[
  {
      "title": "Olive Garden Pasta e Fagioli",
      "ingredients": [
          "1 cup ditalini pasta",
          "2 tablespoons olive oil, divided",
          "1 pound spicy Italian sausage, casing removed",
          "3 cloves garlic, minced",
          "1 onion, diced",
          "3 carrots, peeled and diced",
          "2 stalks celery, diced",
          "3 cups chicken broth",
          "1 (16-ounce) can tomato sauce",
          "1 (15-ounce) can diced tomatoes",
          "1 teaspoon dried basil",
          "1 teaspoon dried oregano",
          "3/4 teaspoon dried thyme",
          "Kosher salt and freshly ground black pepper, to taste",
          "1 (15-ounce) can red kidney beans, drained and rinsed",
          "1 (15-ounce) can Great Northern beans, drained and rinsed"
      ],
      "directions": [
          "In a large pot of boiling salted water, cook pasta according to package instructions; drain well and set aside.",
          "Heat 1 tablespoon olive oil in a large stockpot or Dutch oven over medium heat. Add Italian sausage to the skillet and cook until browned, about 3-5 minutes, making sure to crumble the sausage as it cooks; drain excess fat and set aside.",
          "Add remaining 1 tablespoon oil to the stockpot. Stir in garlic, onion, carrots and celery. Cook, stirring occasionally, until tender, about 3-4 minutes.",
          "Whisk in chicken broth, tomato sauce, diced tomatoes, basil, oregano, thyme, Italian sausage and 1 cup water; season with salt and pepper, to taste. Bring to a boil; reduce heat and simmer, covered, until vegetables are tender, about 10-15 minutes.",
          "Stir in pasta and beans until heated through.",
          "Serve immediately."
      ]
  },
  {
      "title": "Creamy Parmesan Garlic Mushroom Chicken",
      "ingredients": [
          "4 boneless skinless chicken breasts, thinly sliced",
          "2 Tablespoons Olive oil",
          "Salt Pepper",
          "8 ounces sliced mushrooms",
          "1/4 cup butter",
          "2 garlic cloves minced",
          "1 tablespoon flour",
          "1/2 cup chicken broth",
          "1 cup heavy cream or half and half",
          "1/2 cup grated parmesan cheese",
          "1/2 teaspoon garlic powder",
          "1/4 teaspoon pepper",
          "1/2 teaspoon salt",
          "1 cup spinach chopped"
      ],
      "directions": [
          "In a large skillet add olive oil and cook the chicken on medium high heat for 3-5 minutes on each side or until brown on each side and cooked until no longer pink in center. Remove chicken and set aside on a plate. Add the sliced mushrooms and cook for a few minutes until tender. Remove and set aside.",
          "To make the sauce add the butter and melt. Add garlic and cook until tender. Whisk in the flour until it thickens. Whisk in chicken broth, heavy cream, parmesan cheese, garlic powder, pepper and salt. Add the spinach and let simmer until it starts to thicken and spinach wilts. Add the chicken and ,mushrooms back to the sauce and serve over pasta is desired."
      ]
  },
  {
      "title": "Instant Pot Meatloaf",
      "ingredients": [
          "2 pounds ground beef (or ground turkey, ground pork or a combination)",
          "2 large eggs",
          "4 Tablespoons ketchup",
          "2 Tablespoons Worcestershire sauces",
          "2 teaspoons dijon mustard",
          "4 cloves garlic , minced (or 1 1/2 teaspoons garlic powder)",
          "1 teaspoon salt",
          "1/2 teaspoon freshly ground black pepper",
          "1 teaspoon dried sage",
          "1/2 cup sweet onion , diced (or 3 teaspoons dried minced onion",
          "1/2 cup breadcrumbs",
          "1/2 cup ketchup",
          "6 Tablespoons light brown sugar",
          "2 teaspoons dijon mustard",
          "1/4 teaspoon ground nutmeg",
          "3 pounds Yukon Gold Potatoes , quartered",
          "1 cup water",
          "1/4 teaspoon salt",
          "1/4 cup milk",
          "1/4 cup sour cream",
          "3 Tablespoons butter",
          "1 teaspoon bouillon paste (I love 'Better than Bouillon)"
      ],
      "directions": [
          "Add all of the meatloaf ingredients to a large bowl and gently mix everything to combine (without over-working the meat).",
          "Form the meat mixture into a round loaf that will fit into your instant pot.",
          "Place the loaf on a large piece of aluminum foil and fold the edges up to make a secure nest for the meatloaf to rest in. (You want the edges high enough that grease from the loaf wont spill out onto the potatoes while cooking.)",
          "Add the quartered potatoes, water, and salt to the bottom of the instant pot.",
          "Lay the IP wire rack on top of the potatoes. Place the aluminum foil \"nest\" with the meatloaf on top of the rack.",
          "Secure the lid on the pot and close the pressure release valve. Select manual/High pressure and cook at high pressure for 25 minutes*.  When the timer beeps, allow the pressure to naturally release for 10 minutes.",
          "While the meatloaf cooks, make the sauce by combining all of the sauce ingredients in a bowl.",
          "Remove the IP lid, and carefully remove the meatloaf. Discard the aluminum foil and dippings. Spoon the meatloaf sauce over the top and cut into slices.",
          "Add the milk, sour cream, butter, bouillon paste, and salt and pepper to the bottom of the instant pot with the mashed potatoes. Mash to combine (but don't over-mash the potatoes).  Taste and adjust seasonings, as needed."
      ]
  },
  {
      "title": "The Best Homemade Alfredo Sauce Ever!",
      "ingredients": [
          "½ cup butter",
          "1 pint heavy whipping cream 2 cups",
          "4 ounces cream cheese",
          "½ teaspoon minced garlic",
          "1 teaspoon garlic powder",
          "1 teaspoon italian seasoning",
          "¼ teaspoon salt",
          "¼ teaspoon pepper",
          "1 cup grated parmesan cheese"
      ],
      "directions": [
          "In a medium saucepan add butter, heavy whipping cream, and cream cheese. Cook over medium heat and whisk until melted.",
          "Add the minced garlic, garlic powder, italian seasoning, salt and pepper. Continue to whisk until smooth. Add the grated parmesan cheese.",
          "Bring to a simmer and continue to cook for about 3-5 minutes or until it starts to thicken. Toss it with your favorite pasta!"
      ]
  },
  {
      "title": "Street Corn Nachos",
      "ingredients": [
          "2 \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttbsp.\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\textra-virgin olive oil",
          "3 \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tc.\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tfrozen corn",
          "Kosher salt",
          "Freshly ground black pepper",
          "1 \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tjalapeño, seeded and minced",
          "2 \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttbsp.\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tlime juice, divided, plus wedges for serving",
          "1/4\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tc.\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tsour cream",
          "2 \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttbsp.\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tmayonnaise",
          "1 \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t(9-oz.) package corn tortilla chips",
          "2 1/2\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tc.\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tshredded Monterey Jack",
          "2 \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttbsp.\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tcrumbled cotija",
          "2 \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttbsp.\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tfreshly chopped cilantro"
      ],
      "directions": [
          "Preheat oven to 375°. In a large ovenproof skillet over high heat, heat oil. Add corn and season with salt and pepper. Cook, tossing until just cooked through, about 2 minutes. Transfer corn to a large bowl and wipe the skillet.",
          "Stir in jalapeño and 1 tablespoon lime juice to the corn. In a small bowl, stir together sour cream, mayonnaise, and remaining tablespoon lime juice. Season with salt.",
          "Layer tortilla chips and Monterey Jack in skillet. Bake until cheese is melty, about 5 minutes.",
          "Top broiled tortilla chips with corn mixture. Garnish with mayonnaise mixture, cotija, and cilantro."
      ]
  },
  {
      "title": "Instant Pot Honey Garlic Chicken",
      "ingredients": [
          "1/3 cup honey",
          "4 cloves garlic, minced",
          "1/2 cup low sodium soy sauce (see notes for alternatives)",
          "1/2 cup no salt ketchup",
          "1/2 teaspoon dried oregano",
          "2 tablespoons chopped fresh parsley",
          "1 tablespoon sesame seed oil",
          "4 to 6 bone-in, skinless chicken thighs",
          "salt and fresh ground pepper, to taste",
          "1/2 tablespoon toasted sesame seeds, for garnish",
          "sliced green onions, for garnish"
      ],
      "directions": [
          "In a small mixing bowl combine honey, minced garlic, soy sauce, ketchup, oregano and parsley; mix until well combined and set aside.\"Instant",
          "Heat the Instant Pot in sauté mode.",
          "Add sesame oil to the pot.",
          "Season chicken thighs with salt and pepper; arrange in the instant pot and cook for about 2 to 3 minutes per side.\"Instant",
          "Add the prepared honey garlic sauce to the pot; cover and lock the lid. \"Instant",
          "Cook in poultry mode for 20 minutes.",
          "Turn off the pot and allow it to release the pressure, about 5 minutes.",
          "Transfer chicken to a serving plate and spoon the sauce over the chicken.",
          "Garnish with toasted sesame seeds and green onions.",
          "Serve."
      ]
  },
  {
      "title": "Instant Pot Butter Chicken",
      "ingredients": [
          "1 14- ounce Canned Tomatoes",
          "5-6 cloves Garlic",
          "1-2 teaspoons Minced Ginger",
          "1 teaspoon Turmeric",
          "1/2 teaspoons Cayenne Pepper",
          "1 teaspoon Smoked Paprika",
          "1 teaspoon Kosher Salt",
          "1 teaspoon Garam Masala",
          "1 teaspoon Ground Cumin",
          "1 pound Boneless Skinless Chicken Thighs, (or use breast, bone-in, or whatever works for you. If frozen, add 1-2 minutes to total time)",
          "To finish",
          "4 ounces butter cut into cubes, (use coconut oil if dairy free)",
          "4 ounces Heavy Cream, (use full-fat coconut milk if dairy free)",
          "1 teaspoon Garam Masala",
          "1/4-1/2 cup chopped cilantro"
      ],
      "directions": [
          "Place all ingredients into an Instant Pot in the order listed, EXCEPT for the butter, cream and 1 teaspoon of the garam masala, mixing the sauce well before you place the chicken on top of the sauce. If it's frozen, push it into the sauce a bit so it defrosts better",
          "Close the cooker and set for 10 mins on high, and let it release pressure naturally for 10 minutes. After that, release all remaining pressure.",
          "Open up the pot and remove the chicken carefully and set aside",
          "Blend together all the ingredients, preferably using an immersion blender",
          "Add the cut up butter, cream, cilantro, and garam masala and stir until well incorporated.",
          "It's best to let the sauce cool just a little before adding the butter and the cream. Adding it into the boiling sauce will make your sauce very thin. If that happens, just put it in the fridge for a little and let it thicken up. It should be thick enough to coat the back of a spoon",
          "Take out half the sauce and freeze for later or store in the fridge for 2-3 days",
          "Add the chicken back in and heat through. Break it up into smaller pieces if you need but don't shred it.",
          "Serve over rice, or zucchini noodles",
          "Use leftover cooked chicken and mix in with the gently heated sauce, let it simmer for a few for the flavors to meld together and there you go. Add some fresh cilantro on top.",
          "You could also use this for Paneer Makhani. Defrost a cup of peas and 1 cup of paneer and mix gently into the heated sauce and let it simmer for a few for the flavors to meld together and there you go."
      ]
  },
  {
      "title": "Microwave White Chicken Chili",
      "ingredients": [
          "3 whole heads garlic (about 48 cloves), unpeeled",
          "3/4 tsp salt, divided",
          "3 tbsp olive oil, divided",
          "2   poblano peppers",
          "1 medium onion",
          "1 1/2 lb boneless, skinless chicken thighs",
          "2 tbsp Southwestern Seasoning Mix",
          "2 cans (15.5 oz each) Great Northern beans, drained",
          "1 jar (16 oz) salsa verde"
      ],
      "directions": [
          "Using (5-in.) Santoku Knife, slice about 1/4 in. off the pointed top of garlic heads to expose cloves. Place garlic cut side up in Classic Batter Bowl. Sprinkle garlic with 1/4 tsp of the salt and drizzle with 2 tbsp of the oil. Cover batter bowl with lid; microwave on HIGH 3 minutes or until garlic is soft. Set aside to cool.",
          "Meanwhile, finely dice peppers using Santoku Knife. Chop onion using Food Chopper. Combine peppers and onion in Deep Covered Baker. Trim and finely dice chicken using Boning Knife. Add chicken, seasoning mix, remaining 1 tbsp oil and remaining 1/2 tsp salt to baker; mix well using Master Scraper. Microwave, covered, on HIGH 4 minutes; stir to separate chicken. Cover; microwave an additional 4-6 minutes or until chicken is cooked through.",
          "Meanwhile, gently squeeze cooled garlic from heads into batter bowl (discard skins); mash using Mix 'N Masher. Add beans and salsa to batter bowl. Transfer bean mixture to baker; mix well. Microwave, covered, on HIGH 5-7 minutes or until chili is heated through."
      ]
  },
  {
      "title": "Blueberry Buckle",
      "ingredients": [
          "3/4 cup white sugar",
          "1/4 cup butter",
          "1 egg",
          "2 teaspoons lemon zest",
          "1 1/2 cups flour",
          "2 teaspoons baking powder",
          "1/2 teaspoon salt",
          "1/2 cup milk",
          "1 tablespoon flour",
          "1 1/2 cups fresh blueberries",
          "1/4 cup + 1 tablespoon butter softened",
          "1/4 cup brown sugar",
          "1/4 cup white sugar",
          "1/3 cup all-purpose flour",
          "1/2 teaspoon ground cinnamon"
      ],
      "directions": [
          "Preheat oven to 350 degrees. Grease an 8x8 pan.",
          "In a large bowl, cream sugar, butter, egg & lemon zest until fluffy.",
          "In a separate bowl combine flour, baking powder, and salt. Add to sugar mixture, alternating with milk mixing just until combined.",
          "Toss blueberries with 1 tablespoon flour. Fold into batter and spread in prepared pan.",
          "Combine all topping ingredients in a small bowl until crumbly. Sprinkle over batter and bake 40-45 minutes or until a toothpick comes out clean."
      ]
  },{
    "title": "Homemade Hamburger Helper",
    "ingredients": [
      "1\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tpound (500g)\n\t\t\t\t\t\t\t\t\t\tlean ground beef",
      "1\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsmall onion, finely chopped",
      "1\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tteaspoon\n\t\t\t\t\t\t\t\t\t\tpaprika",
      "1\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tteaspoon\n\t\t\t\t\t\t\t\t\t\tdried parsley",
      "1\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tteaspoon\n\t\t\t\t\t\t\t\t\t\tgarlic powder",
      "pinch\n\t\t\t\t\t\t\t\t\t\tto ½ teaspoon cayenne powder",
      "salt and pepper to taste",
      "1½\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcups (355ml)\n\t\t\t\t\t\t\t\t\t\tmilk",
      "1½\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcups (355ml)\n\t\t\t\t\t\t\t\t\t\tbeef broth",
      "2\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcups (260g)\n\t\t\t\t\t\t\t\t\t\telbow macaroni, uncooked",
      "1\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t(8oz) (227g)\n\t\t\t\t\t\t\t\t\t\tcan tomato sauce",
      "2\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcups (225g)\n\t\t\t\t\t\t\t\t\t\tshredded cheddar cheese"
    ],
    "directions": [
      "Heat a large skillet over medium heat. Brown the ground beef, onion, paprika, parsley, garlic powder, cayenne powder, salt and pepper. If using a ground beef with a higher fat content add in the seasonings after draining the grease.",
      "Stir in the milk, broth, macaroni and tomato sauce. Bring to a boil, cover and reduce heat to a simmer. Cook for 10-12 minutes or until pasta is tender. Stir occasionally to prevent sticking.",
      "Stir in cheddar cheese until melted."
    ]
  },{
    "title": "Rich and Creamy Tomato Basil Soup",
    "ingredients": [
      "4 tomatoes - peeled, seeded and diced",
      "4 cups tomato juice",
      "14 leaves fresh basil",
      "1 cup heavy whipping cream",
      "½ cup butter",
      "salt and pepper to taste"
    ],
    "directions": [
      "Place tomatoes and juice in a stock pot over medium heat. Simmer for 30 minutes. Puree the tomato mixture along with the basil leaves, and return the puree to the stock pot.",
      "Place the pot over medium heat, and stir in the heavy cream and butter. Season with salt and pepper. Heat, stirring until the butter is melted. Do not boil."
    ]
  },{
    "title": "One-Pot, No-Roux Macaroni and Cheese",
    "ingredients": [
      "2 cups dry macaroni",
      "2 1/2 cups whole milk",
      "1 tablespoon of butter",
      "8 ounces shredded cheese (I used cheddar but feel free to mix it up)",
      "1 tablespoon cornstarch",
      "1 teaspoon mustard of choice (yellow, Dijon, and stoneground all have their merits)",
      "Hot sauce (optional)"
    ],
    "directions": [
      "Pour the milk in a sauce pan and season it with salt. Add the butter, bring it to a boil",
      "Add the pasta. Reduce to a simmer, and cook until the macaroni is tender and the milk has thickened.",
      "While the pasta is cooking, toss the cheese with cornstarch so that each strand is coated.",
      "Stir the mustard and hot sauce (to taste) into the pasta, season with salt and pepper if needed.",
      "stir in the cheese, handful by handful, letting each one melt completely before adding the next."
    ]
  },{
    "title": "Pork Stew in Green Salsa (Guisado de Puerco con Tomatillos)",
    "ingredients": [
      "½ cup all-purpose flour",
      "1 teaspoon salt (Optional)",
      "1 tablespoon ground black pepper",
      "½ teaspoon ground cumin",
      "1 (3 pound) boneless pork shoulder roast, trimmed of excess fat and cut into 1-inch cubes",
      "2 tablespoons olive oil, or more if needed",
      "1 large onion, chopped",
      "3 cloves garlic, minced",
      "2 cups chopped fresh tomatillos",
      "1 (7 ounce) can diced green chiles, drained",
      "2 fresh jalapeno peppers, seeded and chopped",
      "2 teaspoons dried marjoram",
      "½ cup chopped fresh cilantro",
      "1 cup water",
      "1 pinch salt, or to taste (Optional)",
      "2 tablespoons sour cream, divided",
      "6 sprigs cilantro"
    ],
    "directions": [
      "Stir together the flour, 1 teaspoon salt, pepper, and cumin in a large bowl. Place the cubed pork into the mixture, and stir well to coat the meat with the seasonings.",
      "Heat the olive oil in a large, heavy pan or Dutch oven over medium-high heat until the oil shimmers. Working in batches if necessary, place the meat into the hot pan in a single layer. Pan-fry the pork until brown on all sides, about 15 minutes. Remove the pork to a bowl, and cover to keep warm.",
      "Cook and stir the onion in the hot pan over medium heat, adding more olive oil if necessary, until the onion is translucent and beginning to brown, about 7 minutes. Return the meat to the pan and stir in the garlic, tomatillos, chiles, marjoram, chopped cilantro, and water. Check seasoning and add 1 pinch of salt to taste, if needed. Cover and simmer over low heat, stirring occasionally, until the meat is tender, about 1 hour. Skim excess fat off the stew before serving in bowls, garnished with a dollop of sour cream and a cilantro sprig on each bowl."
    ]
  }
]