[
  {
    "title": "Alfredo Sauce",
    "meal": "dinner",
    "ingredients": [
      "½ cup butter",
      "1 pint heavy whipping cream 2 cups",
      "4 ounces cream cheese",
      "½ teaspoon minced garlic",
      "1 teaspoon garlic powder",
      "1 teaspoon italian seasoning",
      "¼ teaspoon salt",
      "¼ teaspoon pepper",
      "1 cup grated parmesan cheese"
    ],
    "directions": [
      "In a medium saucepan add butter, heavy whipping cream, and cream cheese. Cook over medium heat and whisk until melted.",
      "Add the minced garlic, garlic powder, italian seasoning, salt and pepper. Continue to whisk until smooth. Add the grated parmesan cheese.",
      "Bring to a simmer and continue to cook for about 3-5 minutes or until it starts to thicken. Toss it with your favorite pasta!"
    ]
  },
  {
    "title": "Baileys Irish Cream Brownies",
    "meal": "dessert",
    "ingredients": [
      "1 Boxed Fudge Brownie Mix 9x13 size plus box indicated ingredients or your favorite homemade brownies",
      "¾ cup unsalted butter , softened",
      "⅓ cup Baileys Irish Cream",
      "3 cups powdered sugar",
      "¾ cup semi-sweet chocolate chips",
      "2 tablespoons heavy cream",
      "½ cup Baileys Irish Cream"
    ],
    "directions": [
      "Prepare brownies according to package directions. Cool completely.",
      "Beat butter on medium speed until fluffy. Add in Baileys and mix well.",
      "Add powdered sugar a little at a time until completely incorporated. Beat until soft and fluffy.",
      "Spread over brownies and refrigerate while making the Baileys ganache.",
      "Combine Baileys and heavy cream in a sauce pan over medium high heat. Bring just to a boil and immediately pour over chocolate chips. Let sit 5 minutes without stirring.",
      "Whisk until smooth and spread over frosted brownies. Let sit at room temperature about 30 minutes. Refrigerate until set."
    ]
  },
  {
    "title": "Beef Barley Soup",
    "meal": "dinner",
    "ingredients": [
      "1 tablespoon olive oil",
      "1 onion chopped",
      "1 garlic clove minced",
      "2 carrots sliced",
      "1 stalk celery sliced",
      "2 cups cooked beef",
      "6 cups reduced sodium beef broth",
      "1 can petite diced tomatoes 14-15 oz, undrained",
      "½ green pepper diced",
      "⅔ cup barley",
      "1 tablespoon Worcestershire sauce",
      "¼ teaspoon dried thyme",
      "1 package beef gravy mix",
      "1 bay leaf",
      "2 tablespoons red wine optional",
      "2 tablespoons fresh parsley or 2 teaspoons dried",
      "salt & pepper to taste"
    ],
    "directions": [
      "Cook onions and garlic in oil over medium heat until softened.",
      "Add remaining ingredients and bring to a boil. Reduce heat and simmer covered about 40-50 minutes or until barley is cooked.",
      "Remove bay leaf and serve."
    ]
  },
  {
    "title": "Beef Rice-A-Roni",
    "meal": "dinner",
    "ingredients": [
      "1 cup regular long grain rice not instant",
      "½ cup broken thin spaghetti",
      "2 tbsp butter",
      "2¾ cup beef broth",
      "2 tsp beef bouillon",
      "1 tsp onion powder",
      "4½ tsp Worcestershire",
      "1½ tsp soy sauce",
      "½ tsp garlic powder",
      "½ tsp black pepper",
      "3 Tbsp diced canned carrots"
    ],
    "directions": [
      "In a large skillet, melt 2 Tbsp butter. Add broken pasta and rice. Cook until lightly brown.",
      "Add remaining ingredients. Bring to a boil. Reduce heat to low and cover.",
      "Cook 15-20 minutes, stirring occasionally, until water is absorbed."
    ]
  },
  {
    "title": "Black Beans",
    "meal": "side",
    "ingredients": [
      "1 1/2 cup dried black beans picked over, rinsed, soaked, and rinsed again.",
      "1 bay leaves",
      "1/4 cup coconut oil avocado oil or ghee",
      "1 1/2 cups minced yellow onion",
      "2 cups diced bell pepper",
      "1 1/2 tablespoon ground cumin",
      "1 tablespoon dry oregano",
      "5 cloves garlic minced (or 1 teaspoon garlic powder), or to taste",
      "1/4 cup tomato paste",
      "5 cups broth",
      "cayenne to taste optional",
      "salt and pepper to taste"
    ],
    "directions": [
      "Combine all ingredients EXECPT FOR SALT in your Instant Pot. Stir a few times to mix.",
      "Place the lid on the Instant Pot, lock in place and turn the valve to sealing.",
      "Select the MANUAL setting and use the +/- buttons to set cook time for 9 minutes on HIGH pressure. It will take your pressure cooker about 10 minutes to get up to pressure. This is normal.",
      "Once the beans are done cooking, allow the pressure to naturally release for 15 minutes before quick releasing the remaining pressure.",
      "Remove bay leaves. Stir in salt to taste.",
      "Drain some (or alof the cooking liquid off of beans. How much you drain off is up to you. If you plan on enjoying all of the beans right away, feel free to remove as much of the liquid as you like. However, if you plan to store these beans, I recommend saving some to help the beans from becoming to dry in the fridge. Or keep all the cooking liquid in and enjoy the beans as a soup!",
      "Store leftovers in fridge from up to a week or in freezer for months to come!"
    ]
  },
  {
    "title": "Blueberry Buckle",
    "meal": "dessert",
    "ingredients": [
      "3/4 cup white sugar",
      "1/4 cup butter",
      "1 egg",
      "2 teaspoons lemon zest",
      "1 1/2 cups flour",
      "2 teaspoons baking powder",
      "1/2 teaspoon salt",
      "1/2 cup milk",
      "1 tablespoon flour",
      "1 1/2 cups fresh blueberries",
      "1/4 cup + 1 tablespoon butter softened",
      "1/4 cup brown sugar",
      "1/4 cup white sugar",
      "1/3 cup all-purpose flour",
      "1/2 teaspoon ground cinnamon"
    ],
    "directions": [
      "Preheat oven to 350 degrees. Grease an 8x8 pan.",
      "In a large bowl, cream sugar, butter, egg & lemon zest until fluffy.",
      "In a separate bowl combine flour, baking powder, and salt. Add to sugar mixture, alternating with milk mixing just until combined.",
      "Toss blueberries with 1 tablespoon flour. Fold into batter and spread in prepared pan.",
      "Combine all topping ingredients in a small bowl until crumbly. Sprinkle over batter and bake 40-45 minutes or until a toothpick comes out clean."
    ]
  },
  {
    "title": "Butter Chicken",
    "meal": "dinner",
    "ingredients": [
      "1 14-15 ounce Canned Sauce",
      "3 tablespoons Garlic",
      "1-2 teaspoons Minced Ginger",
      "1 teaspoon Turmeric",
      "1/2 teaspoons Red Pepper Flakes",
      "1 teaspoon Smoked Paprika",
      "1 teaspoon Kosher Salt",
      "1 teaspoon Garam Masala",
      "1 teaspoon Ground Cumin",
      "1 pound Boneless Skinless Chicken Thighs, (or use breast, bone-in, or whatever works for you. If frozen, add 1-2 minutes to total time)",
      "To finish",
      "4 ounces butter cut into cubes, (use coconut oil if dairy free)",
      "4 ounces Heavy Cream, (use full-fat coconut milk if dairy free)",
      "1 teaspoon Garam Masala",
      "1/4-1/2 cup chopped cilantro"
    ],
    "directions": [
      "Place all ingredients into an Instant Pot in the order listed, EXCEPT for the butter, cream and 1 teaspoon of the garam masala, mixing the sauce well before you place the chicken on top of the sauce. If it's frozen, push it into the sauce a bit so it defrosts better",
      "Close the cooker and set for 10 mins on high, and let it release pressure naturally for 10 minutes. After that, release all remaining pressure.",
      "Add the cut up butter, cream, cilantro, and garam masala and stir until well incorporated.",
      "Serve over rice, or zucchini noodles"
    ]
  },
  {
    "title": "Carrot Cake Oatmeal",
    "meal": "dessert",
    "ingredients": [
      "4-1/2 cups water",
      "1 can (20 ounces) crushed pineapple, undrained",
      "2 cups shredded carrots",
      "1 cup steel-cut oats",
      "1 cup raisins",
      "2 teaspoons ground cinnamon",
      "1 teaspoon pumpkin pie spice",
      "Brown sugar, optional"
    ],
    "directions": [
      "In a 6-qt. electric pressure cooker coated with cooking spray, combine the first 7 ingredients. Lock lid; make sure vent is closed. Select manual setting; adjust pressure to high, and set time for 10 minutes. When finished cooking, allow pressure to naturally release for 10 minutes, then quick-release any remaining pressure. If desired, sprinkle with brown sugar."
    ]
  },
  {
    "title": "Cheesy Shells & Italian Sausage ",
    "meal": "dinner",
    "ingredients": [
      "8 oz. (250 g) hot Italian turkey sausage (2 links, casings removed)",
      "3   garlic cloves",
      "1½ cups (375 mL) low-sodium chicken broth",
      "1½ cups (375 mL) marinara sauce",
      "8 oz. (250 g) medium shell pasta (3 cups/750 mL)",
      "¼ cup (60 mL) fresh basil leaves",
      "1 cup (250 mL) seasoned croutons",
      "½ cup (125 mL) fresh Parmesan cheese, grated",
      "4 oz. (125 g) reduced-fat cream cheese (Neufchâtel)"
    ],
    "directions": [
      "Preheat the broiler. Use the Coated Utility Knife to remove the florets from the stem of the broccoli. Use the Quick Slice to slice the florets.",
      "Place the sausage into the Rockcrok® Everyday Pan or Dutch Oven. Cook over medium heat for 4–6 minutes, using the Mix ‘N Chop to break the sausage into crumbles.",
      "Press the garlic into the pan with the Garlic Press. Cook for 30–60 seconds, or just until the garlic is fragrant.",
      "Stir the broth, marinara, broccoli, and pasta into the pan. Increase the heat to high; cover and bring to a boil. Reduce the heat to medium and cook, stirring occasionally, for 7–9 minutes, or until the pasta is cooked but firm.",
      "Meanwhile, chop the basil with the Coated Utility Knife. Process the croutons in the Manual Food Processor until finely chopped. Remove the blade and add the Parmesan cheese. Stir with the Small Mix ‘N Scraper® to combine.",
      "Remove the pan from the heat. Stir in the cream cheese and basil until blended. Sprinkle the crouton mixture evenly over the pasta. Place the pan 2\"–4\" (5–10 cm) from the heating element. Broil for 1–2 minutes, or until the top is golden brown."
    ]
  },
  {
    "title": "Chicken Shawarma (Air-Fried)",
    "source": "https://bluejeanchef.com/recipes/chicken-shawarma-wrap/",
    "meal": "dinner",
    "ingredients": [
      "2 tablespoons olive oil",
      "2 garlic cloves minced",
      "juice of 1 lemon",
      "1 teaspoon ground cumin",
      "1 teaspoon paprika",
      "½ teaspoon ground allspice",
      "¼ teaspoon turmeric",
      "dash ground cinnamon",
      "1 teaspoon salt",
      "½ teaspoon freshly ground black pepper",
      "1½ pounds boneless chicken breast about 3 chicken breasts"
    ],
    "directions": [
      "Combine the the olive oil, garlic, lemon juice, and spices in a small bowl, whisking well.",
      "Cut the chicken breasts in half lengthwise. Place the chicken in a zipper sealable plastic bag and add the marinade. Massage the chicken in the bag to coat all sides of the chicken with the marinade. Marinate the chicken in the refrigerator for 6 hours, or as long as overnight.",
      "Pre-heat the air fryer to 380°F.",
      "Transfer the marinated chicken breasts to the air fryer basket and air-fry at 380ºF for 8 to 10 minutes, flipping the chicken over halfway through the cooking process."
    ]
  },
  {
    "title": "Chicken Marsala",
    "meal": "dinner",
    "ingredients": [
      "1½ pounds  boneless skinless chicken breasts, pounded ¼-inch thick (see note), or chicken tenderloins",
      "3 tablespoons all-purpose flour",
      "Salt",
      "Freshly ground black pepper",
      "1 tablespoon  olive oil",
      "3 tablespoons  unsalted butter, divided",
      "1 (8-oz) package pre-sliced bella or button mushrooms",
      "3 tablespoons  finely chopped shallots, from 1 medium shallot",
      "2  cloves garlic, minced",
      "⅔ cup  chicken broth",
      "⅔ cup  dry Marsala wine",
      "⅔ cup  heavy cream",
      "2 teaspoons  chopped fresh thyme",
      "2 tablespoons  chopped fresh Italian parsley, for serving (optional)"
    ],
    "directions": [
      "Place the flour, ¾ teaspoon salt, and ¼ teaspoon pepper in a ziplock bag. Add the chicken to the bag; seal bag tightly and shake to coat chicken evenly. Set aside.",
      "Heat the oil and 2 tablespoons of the butter in a large skillet over medium-high heat. (Use a stainless steel pan for the best browning. Nonstick will work too, but you won’t get that nice golden color on the chicken.) Place the flour-dusted chicken in the pan, shaking off any excess first, and cook, turning once, until the chicken is golden and just barely cooked through, about 5 to 6 minutes total. Transfer the chicken to a plate and set aside.",
      "Melt the remaining tablespoon of butter in the pan. Add the mushrooms and cook, stirring frequently, until the mushrooms begin to brown, 3 to 4 minutes. Add the shallots, garlic, and ¼ teaspoon of salt; cook for 1 to 2 minutes more. Add the broth, Marsala, heavy cream, thyme, ¼ teaspoon salt, and ⅛ teaspoon of pepper; use a wooden spoon to scrape any brown bits from the pan into the liquid. Bring the liquid to a boil, then reduce the heat to medium and gently boil, uncovered, until the sauce is reduced by about half, slightly thickened, and darkened in color, 10 to 15 minutes (you’re going for a thin cream sauce; it won’t start to thicken until the very end of the cooking time). Add the chicken back to the pan, along with any juices that accumulated on the plate. Reduce the heat to low and simmer until the chicken is warmed through and the sauce thickens a bit more, 2 to 3 minutes. Sprinkle with parsley, if using, and serve."
    ]
  },
  {
    "title": "Chicken Pot Pie",
    "meal": "dinner",
    "ingredients": [
      "1 pound skinless, boneless chicken breast halves - cubed",
      "1 cup sliced carrots",
      "24 oz mushrooms",
      "½ cup sliced celery",
      "⅓ cup butter",
      "⅓ cup chopped onion",
      "⅓ cup all-purpose flour",
      "½ teaspoon salt",
      "¼ teaspoon black pepper",
      "¼ teaspoon celery seed",
      "1 ¾ cups chicken broth",
      "⅔ cup milk",
      "2 (9 inch) unbaked pie crusts"
    ],
    "directions": [
      "Preheat oven to 425 degrees F (220 degrees C.)",
      "In a saucepan, combine chicken, carrots, mushrooms, and celery. Add water to cover and boil for 15 minutes. Remove from heat, drain and set aside.",
      "In the saucepan over medium heat, cook onions in butter until soft and translucent. Stir in flour, salt, pepper, and celery seed. Slowly stir in chicken broth and milk. Simmer over medium-low heat until thick. Remove from heat and set aside.",
      "Place the chicken mixture in bottom pie crust. Pour hot liquid mixture over. Cover with top crust, seal edges, and cut away excess dough. Make several small slits in the top to allow steam to escape.",
      "Bake in the preheated oven for 30 to 35 minutes, or until pastry is golden brown and filling is bubbly. Cool for 10 minutes before serving."
    ]
  },
  {
    "title": "Chicken Tortilla Soup",
    "meal": "dinner",
    "ingredients": [
      "1 lb chicken thighs",
      "1 (15 ounce) can crushed tomatoes",
      "1 (15 ounce) can diced tomatoes with green chilies",
      "1 (10 ounce) can enchilada sauce",
      "1 medium onion, chopped",
      "2 cloves garlic, minced",
      "4 cups water",
      "better than chicken bullion",
      "1 teaspoon cumin",
      "1 teaspoon chili powder",
      "1 teaspoon salt",
      "¼ teaspoon black pepper",
      "~10 ounces frozen corn",
      "1 tablespoon chopped cilantro"
    ],
    "directions": [
      "Place chicken, tomatoes, enchilada sauce, onion, green chiles, and garlic into a slow cooker. Pour in water and chicken broth, and season with cumin, chili powder, salt, pepper, and bay leaf. Stir in corn and cilantro. Cover, and cook on Low setting for 6 to 8 hours or on High setting for 3 to 4 hours."
    ]
  },
  {
    "title": "Chili (Instant Pot)",
    "meal": "dinner",
    "ingredients": [
      "2 cups dry pinto/red/kidney/black beans",
      "1–2 tablespoons olive oil",
      "1 onion, diced",
      "1 pound ground organic beef/italian sausage",
      "4 cloves garlic (or 1 tablespoon granulated garlic)",
      "1½ teaspoons kosher salt",
      "½ teaspoon pepper",
      "1 tablespoons chili powder, more to taste",
      "1 tablespoon cumin",
      "2 teaspoons dried Mexican oregano",
      "14-ounce diced or crushed tomatoes with juices ( fire-roasted are nice here)",
      "1–3 tablespoons fresh jalapeño, finely chopped (optional, adds a kick of heat)",
      "2 tablespoons tomato paste",
      "2½ cups beef, chicken or veggie broth",
      "1 cup dark beer (or sub more broth)",
      "1 tablespoon Worcestershire sauce (optional) or soy sauce",
      "1–2 teaspoons dark cocoa powder, (optional, adds delicious  depth)",
      "1–2 teaspoons smoked paprika (optional, adds smoky flavor) or ½ teaspoon chipotle powder",
      "optional additions: frozen corn (fire-roasted is nice)"
    ],
    "directions": [
      "Place dry unsoaked beans in the Instant pot, and add water, one inch above the level of the beans. Pressure cook on high for 10 minutes. (See notes). Manually release. Drain and set aside.",
      "While the beans are pressure cooking prep your onions and garlic, open any cans and gather all the spices.",
      "Turn Instant Pot to Saute function and heat the oil. Add the onion and saute 2-3 minutes, until fragrant. Add garlic and the ground meat or soy crumbles. Saute 3-4 more minutes, while continuously stirring and breaking up the meat. I find a metal spatula comes in handy for this. Add the salt, pepper, chili powder, cumin, oregano,  and saute one minute, cooking the spices a bit. Add the diced tomatoes and juices, tomato paste, broth, beer, Worcestershire, cocoa powder, smoked paprika or chipotle, optional jalapeño. Give a good stir, then add the pressure cooked beans (drained) or pre-soaked beans.",
      "Set Instant Pot to high pressure for 22 minutes. Naturally release for 15 minutes.",
      "If you like a thicker chili, stir in a little masa harina or masa corn flour, sprinkling it in a tablespoon at a time. This also adds delicious “corn” flavor. You can also stir in frozen corn and set to “saute” function until heated through.",
      "Taste, adjust spice level and salt.  If you want more “kick” add it!"
    ]
  },
  {
    "title": "Corned Beef Hash",
    "meal": "dinner",
    "ingredients": [
      "2 to 3 tablespoons unsalted butter",
      "1 medium onion, finely chopped (about 1 cup)",
      "2 to 3 cups finely chopped, cooked corned beef",
      "2 to 3 cups chopped cooked potatoes, preferably Yukon gold",
      "Salt and pepper",
      "Chopped fresh parsley"
    ],
    "directions": [
      "Sauté onions in butter:  \n\nHeat butter in a large skillet (preferably cast iron) on medium heat. Add the onion and cook a few minutes, until translucent.\n\n\n\n\n\n\n\n\n \n\nElise Bauer",
      "Add potatoes and corned beef:  \n\nMix in the chopped corned beef and potatoes. Spread out evenly over the pan. Increase the heat to high or medium high and press down on the mixture with a metal spatula.\n\n\n\n\n\n\n\n\n \n\nElise Bauer",
      "Cook until browned, then flip:  \n\nDo not stir the potatoes and corned beef, but let them brown. If you hear them sizzling, this is good.\n\n\nUse a metal spatula to peek underneath and see if they are browning. If nicely browned, use the spatula to flip sections over in the pan so that they brown on the other side. Press down again with the spatula.\n\n\nIf there is too much sticking, you can add a little more butter to the pan. Continue to cook in this manner until the potatoes and the corned beef are nicely browned.",
      "Stir in parsley, black pepper to serve:  \n\nRemove from heat, stir in chopped parsley. Add plenty of freshly ground black pepper, and add salt to taste.\n\n\nServe with fried or poached eggs for breakfast."
    ]
  },
  {
    "title": "Cottage pie",
    "meal": "dinner",
    "ingredients": [
      "3 tbsp olive oil",
      "1¼ kg beef mince",
      "2 onions, finely chopped",
      "3 carrots, chopped",
      "3 celery sticks, chopped",
      "2 garlic cloves, finely chopped",
      "3 tbsp plain flour",
      "1 tbsp tomato purée",
      "large glass red wine (optional)",
      "850ml beef stock",
      "4 tbsp Worcestershire sauce",
      "few thyme sprigs",
      "2 bay leaves",
      "1.8kg potatoes, chopped",
      "225ml milk",
      "25g butter",
      "200g strong cheddar, grated",
      "freshly grated nutmeg"
    ],
    "directions": [
      "Heat 1 tbsp olive oil in a large saucepan and fry 1¼ kg beef mince until browned – you may need to do this in batches. Set aside as it browns.",
      "Put the other 2 tbsp olive oil into the pan, add 2 finely chopped onions, 3 chopped carrots and 3 chopped celery sticks and cook on a gentle heat until soft, about 20 mins.",
      "Add 2 finely chopped garlic cloves, 3 tbsp plain flour and 1 tbsp tomato purée, increase the heat and cook for a few mins, then return the beef to the pan.",
      "Pour over a large glass of red wine, if using, and boil to reduce it slightly before adding the 850ml beef stock, 4 tbsp Worcestershire sauce, a few thyme sprigs and 2 bay leaves.",
      "Bring to a simmer and cook, uncovered, for 45 mins. By this time the gravy should be thick and coating the meat. Check after about 30 mins – if a lot of liquid remains, increase the heat slightly to reduce the gravy a little. Season well, then discard the bay leaves and thyme stalks.",
      "Meanwhile, make the mash. In a large saucepan, cover the 1.8kg potatoes which you've peeled and chopped, in salted cold water, bring to the boil and simmer until tender.",
      "Drain well, then allow to steam-dry for a few mins. Mash well with the 225ml milk, 25g butter, and three-quarters of the 200g strong cheddar cheese, then season with freshly grated nutmeg and some salt and pepper.",
      "Spoon the meat into 2 ovenproof dishes. Pipe or spoon on the mash to cover. Sprinkle on the remaining cheese.",
      "If eating straight away, heat oven to 220C/200C fan/gas 7 and cook for 25-30 mins, or until the topping is golden.",
      "If you want to use a slow cooker, brown your mince in batches then tip into your slow cooker and stir in the vegetables, flour, purée, wine, stock, Worcestershire sauce and herbs with some seasoning. Cover and cook on High for 4-5 hours. Make the mash following the previous steps, and then oven cook in the same way to finish."
    ]
  },
  {
    "title": "Creamy Parmesan Garlic Mushroom Chicken",
    "meal": "dinner",
    "ingredients": [
      "4 boneless skinless chicken breasts, thinly sliced",
      "2 Tablespoons Olive oil",
      "Salt Pepper",
      "8 ounces sliced mushrooms",
      "1/4 cup butter",
      "2 garlic cloves minced",
      "1 tablespoon flour",
      "1/2 cup chicken broth",
      "1 cup heavy cream or half and half",
      "1/2 cup grated parmesan cheese",
      "1/2 teaspoon garlic powder",
      "1/4 teaspoon pepper",
      "1/2 teaspoon salt",
      "1 cup spinach chopped"
    ],
    "directions": [
      "In a large skillet add olive oil and cook the chicken on medium high heat for 3-5 minutes on each side or until brown on each side and cooked until no longer pink in center. Remove chicken and set aside on a plate. Add the sliced mushrooms and cook for a few minutes until tender. Remove and set aside.",
      "To make the sauce add the butter and melt. Add garlic and cook until tender. Whisk in the flour until it thickens. Whisk in chicken broth, heavy cream, parmesan cheese, garlic powder, pepper and salt. Add the spinach and let simmer until it starts to thicken and spinach wilts. Add the chicken and ,mushrooms back to the sauce and serve over pasta is desired."
    ]
  },
  {
    "title": "Egg Roll in a Bowl",
    "source": "https://www.theseasonedmom.com/egg-roll-in-a-bowl/#recipe",
    "meal": "dinner",
    "ingredients": [
      "1 lb. ground pork",
      "1 sweet onion, diced",
      "1 tablespoon sesame oil",
      "1 tablespoon rice vinegar",
      "2 teaspoons minced fresh garlic",
      "1 teaspoon ground ginger",
      "¼ cup less sodium soy sauce",
      "1 (16 ounce) bag coleslaw mix",
      "½ cup grated or “matchstick” carrots",
      "2 green onions, thinly sliced",
      "Salt and pepper, to taste",
      "1  tablespoon hoisin sauce (optional, but recommended)"
    ],
    "directions": [
      "Heat a large skillet over medium-high heat. Add ground meat and cook, stirring, until no longer pink. Drain; return meat to skillet.",
      "Add diced onion, sesame oil, and rice vinegar to the skillet. Cook, stirring, for a few more minutes (until onion is tender).",
      "Add garlic, ginger, soy sauce, hoisin sauce (optional), coleslaw mix, and carrots to the skillet. Cook, stirring, for about 5-7 more minutes, or until cabbage is wilted.",
      "Remove skillet from the heat. Stir in green onions and season with salt and pepper, to taste."
    ]
  },
  {
    "title": "Elote Grilled Mexican Corn Salad",
    "meal": "side",
    "ingredients": [
      "6 Ears Sweet Corn , husked",
      "1/3 Cup Crema  *see note for substitution",
      "4  Tablespoons Lime Juice (fresh is best)",
      "1/2  Teaspoon  Ground Cumin",
      "3/4  Teaspoons  Smoked Paprika",
      "1/2 Teaspoon Chili Powder",
      "1/4  Teaspoon  Black Pepper",
      "1/4  Teaspoon Salt , plus more to taste",
      "1/2 Cup  Cheese Crumbled Cotija",
      "1/2 Onion Red , minced",
      "1/3-1/2 Bunch  Cilantro , chopped"
    ],
    "directions": [
      "Heat a grill to medium heat. Add the corn, turning occasionally until slightly charred on each side.",
      "Remove from the grill and allow to cool for a few minutes.",
      "Holding the corn by the small end, cut off all of the kernels.",
      "Place the kernels in a big bowl and add all remaining ingredients.",
      "Fold gently with a rubber spatula, seasoning with additional salt as needed.",
      "Serve slightly warm, room temperature or cold."
    ]
  },
  {
    "title": "French String Beans with Shallots",
    "source": "https://www.onceuponachef.com/recipes/french-string-beans-with-shallots.html#tabrecipe",
    "meal": "side",
    "ingredients": [
      "2 tablespoons extra virgin olive oil or unsalted butter",
      "2 large shallots, thinly sliced",
      "½ cup water",
      "¾ pound (12 ounces) French string beans (haricots verts), trimmed",
      "½ teaspoon salt",
      "¼ teaspoon freshly ground black pepper"
    ],
    "directions": [
      "Heat the oil in a large skillet over medium-low heat. Add the shallots and cook, stirring frequently, until soft and translucent, about 8 minutes. Do not brown.",
      "Add the beans, salt, pepper and water; bring to a boil. Cover the skillet, reduce the heat to low, and cook for 8 minutes.",
      "Remove the lid and increase the heat to high. Cook, stirring frequently, until the liquid is evaporated, the beans are tender, and the shallots are jammy, about 6 minutes. Taste and adjust the seasoning with salt, pepper, and a pinch of sugar. Serve warm."
    ]
  },
  {
    "title": "Fried Cabbage",
    "meal": "side",
    "ingredients": [
      "5-6  thick bacon strips Cut into small pieces",
      "1/3 cup onion Finely chopped",
      "1/2  head green cabbage shredded or roughly chopped",
      "Salt To taste",
      "Pepper To taste",
      "1/4 tsp Smoked paprika"
    ],
    "directions": [
      "Cook bacon in a non-stick pan over medium heat until crisp. Use a slotted spatula to remove the bacon and place it on plate. Do not discard the bacon grease and drippings!",
      "In the same pan, add onion and cook until translucent.",
      "Add cabbage, salt, pepper, paprika and mix everything together. Cook for about 7 minutes or until cabbage is tender.",
      "Add bacon back into the pan and mix it together with the cabbage and serve warm."
    ]
  },
  {
    "title": "Frikadellen",
    "source": "https://www.daringgourmet.com/frikadeller-frikadellen/#recipe",
    "meal": "dinner",
    "ingredients": [
      "1/2 pound ground beef",
      "1/2 pound ground pork",
      "1 medium yellow onion , very finely chopped",
      "2 slices slightly stale white bread (about 2 oz or 50 g) (can also use fresh croutons and let them sit out a day)",
      "1/4 cup warm water or milk",
      "1 large egg",
      "1 clove garlic, minced",
      "1/4 cup chopped fresh parsley",
      "1 1/2 teaspoons salt",
      "3/4 teaspoon freshly ground black pepper",
      "1 teaspoon prepared yellow mustard",
      "1 teaspoon dried oregano",
      "1 teaspoon sweet Hungarian paprika",
      "3 tablespoons olive oil",
      "1 tablespoon butter"
    ],
    "directions": [
      "Break the bread up into small pieces, place them in a small bowl and pour water/milk over them and let them soak for 15 minutes while you're preparing the other ingredients.",
      "Squeeze out any excess liquid.",
      "Place all of the ingredients (except for the olive oil and butter) in a large bowl along with the onion mixture and the soaked bread. Use your hands to thoroughly knead the mixture until well blended and the meat is smooth. The more you knead it, the better the results. Form the meat mixture into balls according to desired size and slightly flatten them. Cover and chill the patties in the fridge for at least 30 minutes.",
      "Heat the olive oil and butter in a frying pan. Once hot add the Frikadellen / Frikadeller and fry on both sides on higher heat until nicely browned, then lower the heat and continue to fry over medium heat until cooked through according to desired doneness. Traditionally served with potato salad or a crusty bread roll slathered with mustard."
    ]
  },
  {
    "title": "German Apple-Almond Cake",
    "meal": "dessert",
    "ingredients": [
      "4 medium apples",
      "1 lemon, zested and juiced",
      "7 ounces (200g) almond paste",
      "1/3 cup sugar",
      "1/2 teaspoon salt",
      "14 tablespoons (200g) unsalted butter, melted and cooled",
      "1 teaspoons almond extract",
      "4 large eggs, at room temperature",
      "1 cup, 3 tablespoons (150g) flour",
      "9 tablespoons (80g) cornstarch",
      "2 teaspoons baking powder, preferably aluminum free",
      "1/4 cup (75g) apricot jam, strained if lumpy"
    ],
    "directions": [
      "Butter a 9- to 10-inch (23cm) springform pan and line the bottom with parchment paper.",
      "Peel and core the apples. Divide the lemon juice into two separate bowls. Slice two of the peeled and cored apples into 1/2-inch (1,25cm) slices, and toss the apple slices in one bowl of lemon juice. Dice the other two apples into 1/3-inch (1cm) cubes. Toss in the other bowl of lemon juice.",
      "Preheat the oven to 350ºF (180ºC).",
      "Using a grater with large holes, grate the almond paste into the bowl of a stand mixer fitted with the paddle attachment. Add the sugar and salt and mix until the almond paste is finely broken up.",
      "Add the melted butter, almond extract, and lemon zest, and continue mixing until smooth. Add the eggs one at a time, stopping the mixer and scraping down the sides of the bowl after each addition.",
      "Whisk together the flour, cornstarch and baking powder in a small bowl. Stir the dry ingredients into the almond batter mixture by hand, then fold in the diced apples, along with any lemon juice in the bowl.",
      "Scrape the batter into the prepared pan and smooth the top. Place the sliced apples in concentric circles on top of the batter, pressing them in very lightly.",
      "Bake the cake until the top is golden brown and a toothpick inserted into the center comes out clean, about 1 hour and 10 minutes.",
      "Remove the cake from the oven. Warm the apricot jam in a small saucepan and brush it over the top while the cake is hot. Let the cake cool completely, then run a knife around the inside of the cake pan to release the cake, and remove the sides of the cake pan. Brush the top of the cake with the apricot jam."
    ]
  },
  {
    "title": "Green Enchilada Chicken Soup",
    "meal": "dinner",
    "ingredients": [
      "2.5lbs boneless skinless chicken thighs",
      "28oz green enchilada sauce",
      "24oz chicken broth",
      "1 cup half n half or heavy cream",
      "2 cups monterey jack cheese",
      "4 oz cream cheese",
      "4 oz salsa verde"
    ],
    "directions": [
      "in a crock pot add chicken, enchilada sauce and broth and cook on low for 6-8 hours",
      "30 minutes before serving, shred chicken, add cheeses, half n half, salsa verde",
      "stir until cheeses are melted"
    ]
  },
  {
    "title": "Green Enchilada Sauce",
    "meal": "condiment",
    "ingredients": [
      "2 tablespoons oil",
      "1/2 cup finely chopped onion",
      "1-2 garlic cloves, finely minced",
      "3 tablespoons flour",
      "1/4 teaspoon cumin",
      "1/4 teaspoon black pepper",
      "1 1/2 cups low-sodium chicken or vegetable broth",
      "1 cup Anaheim or poblano chiles, roasted and peeled OR 1 cup canned diced green chiles, rinsed and drained",
      "1/4 teaspoon dried oregano",
      "1/2 teaspoon salt",
      "1 medium jalapeno, finely diced (optional)"
    ],
    "directions": [
      "In a medium saucepan, heat the oil over medium heat until hot. Add the onion and garlic and cover. Cook for 5-6 minutes, stirring once or twice to make sure the garlic and onions aren't sticking (adjust the heat if they are). Cook until the onions are soft but not browned.",
      "Stir in the flour and cook for 2-3 minutes, stirring constantly. It's ok if the flour clumps around the onions, just keep stirring to let the flour get golden and toasty.",
      "Gradually add the broth, whisking quickly and constantly to smooth out any lumps.",
      "Add all the remaining ingredients and bring to a boil. Reduce the heat to low and simmer for 30 minutes, stirring occasionally. The sauce should be silky and thickened - able to coat a spoon but still drip off. Add more broth to thin out if needed.",
      "Add additional salt to taste, if needed. The sauce can be processed in a blender if you prefer a smoother consistency. It will keep well in the fridge for up to 2 weeks. Otherwise, it can be frozen - probably up to a month or two if well sealed."
    ]
  },
  {
    "title": "Hamburger Helper",
    "meal": "dinner",
    "ingredients": [
      "1\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tpound (500g)\n\t\t\t\t\t\t\t\t\t\tlean ground beef",
      "1\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsmall onion, finely chopped",
      "1\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tteaspoon\n\t\t\t\t\t\t\t\t\t\tpaprika",
      "1\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tteaspoon\n\t\t\t\t\t\t\t\t\t\tdried parsley",
      "1\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tteaspoon\n\t\t\t\t\t\t\t\t\t\tgarlic powder",
      "pinch\n\t\t\t\t\t\t\t\t\t\tto ½ teaspoon cayenne powder",
      "salt and pepper to taste",
      "1½\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcups (355ml)\n\t\t\t\t\t\t\t\t\t\tmilk",
      "1½\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcups (355ml)\n\t\t\t\t\t\t\t\t\t\tbeef broth",
      "2\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcups (260g)\n\t\t\t\t\t\t\t\t\t\telbow macaroni, uncooked",
      "1\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t(8oz) (227g)\n\t\t\t\t\t\t\t\t\t\tcan tomato sauce",
      "2\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcups (225g)\n\t\t\t\t\t\t\t\t\t\tshredded cheddar cheese"
    ],
    "directions": [
      "Heat a large skillet over medium heat. Brown the ground beef, onion, paprika, parsley, garlic powder, cayenne powder, salt and pepper. If using a ground beef with a higher fat content add in the seasonings after draining the grease.",
      "Stir in the milk, broth, macaroni and tomato sauce. Bring to a boil, cover and reduce heat to a simmer. Cook for 10-12 minutes or until pasta is tender. Stir occasionally to prevent sticking.",
      "Stir in cheddar cheese until melted."
    ]
  },
  {
    "title": "Hard Boiled Eggs",
    "meal": "side",
    "ingredients": ["6 large eggs"],
    "directions": [
      "Prepare pot and steamer basket:  \n\nIf you are using a steamer basket, fill a saucepan with as much water as needed to reach the bottom of the steamer basket (about 1 inch or so).\n\n\n\n\n\n\n\n\n \n\nElise Bauer\n\n\n\n\n\n\n\n\n\n \n\nElise Bauer\n\n\n\nIf you are not using a steamer basket, just fill the bottom of a saucepan with 1/2 inch of water.",
      "Heat water to boiling, add eggs to pot:  \n\nHeat the water on high heat until it is boiling and producing steam.\n\n\nTurn off the heat and gently place the eggs at the bottom of the steamer basket or the bottom of the pan.\n\n\nTurn the heat back on again to medium high, and cover the pot.\n\n\nThis method works best if the eggs are in a single layer, but you can double them up as well, you'll just need to add more time to the steaming time.\n\n\n\n\n\n\n\n\n \n\nElise Bauer\n\n\n\n\n\n\n\n\n\n \n\nElise Bauer",
      "Set your timer and steam the eggs:  \n\nSet your timer for 6 minutes for soft boiled, 10 minutes for hard boiled with a still translucent and bright yolk, or 12-15 minutes for cooked-through hard boiled.\n\n\nIf you have doubled up the eggs in the pan and they are not in a single layer, you may need to add a couple minutes or so to the cooking time for hard boiled.\n\n\nThe size large eggs used in these photos were cooked to my satisfaction after 15 minutes when I cooked 6 in a single layer, and 17 minutes when I cooked 12 in the pan.\n\n\nNote that many things will influence the steaming time, including altitude and the size of the particular eggs you are using. I recommend removing one egg a couple minutes before you think it should be done, rinsing it with cold water, and breaking it open to see if it is done enough for you.",
      "Remove eggs to a bowl of icy cold water:  \n\nRemove eggs with a spoon to a bowl of cold water or ice water, or run cold water directly into the pan to cover the eggs and quickly cool them down."
    ]
  },
  {
    "title": "Hollandaise Sauce",
    "meal": "condiment",
    "ingredients": [
      "2 tbsp (30 mL) lemon juice",
      "1 tbsp (15 mL) water",
      "3   egg yolks",
      "1   stick (½ cup/125 mL) butter, cold, cubed",
      "¼ tsp (1 mL) salt",
      "1   stick (½ cup/125 mL) butter, cold, cubed"
    ],
    "directions": [
      "Add the first stage ingredients, in the order listed, to the Deluxe Cooking Blender. Replace and lock the lid. Turn the wheel to select the SAUCE setting; press the wheel to start.",
      "When prompted to “Add”, press CANCEL. Add the butter and press PULSE until combined."
    ]
  },
  {
    "title": "Honey Garlic Chicken",
    "meal": "dinner",
    "ingredients": [
      "1/3 cup honey",
      "4 cloves garlic, minced",
      "1/2 cup low sodium soy sauce (see notes for alternatives)",
      "1/2 cup no salt ketchup",
      "1/2 teaspoon dried oregano",
      "2 tablespoons chopped fresh parsley",
      "1 tablespoon sesame seed oil",
      "4 to 6 bone-in, skinless chicken thighs",
      "salt and fresh ground pepper, to taste",
      "1/2 tablespoon toasted sesame seeds, for garnish",
      "sliced green onions, for garnish"
    ],
    "directions": [
      "In a small mixing bowl combine honey, minced garlic, soy sauce, ketchup, oregano and parsley; mix until well combined and set aside.\"Instant",
      "Heat the Instant Pot in sauté mode.",
      "Add sesame oil to the pot.",
      "Season chicken thighs with salt and pepper; arrange in the instant pot and cook for about 2 to 3 minutes per side.\"Instant",
      "Add the prepared honey garlic sauce to the pot; cover and lock the lid. \"Instant",
      "Cook in poultry mode for 20 minutes.",
      "Turn off the pot and allow it to release the pressure, about 5 minutes.",
      "Transfer chicken to a serving plate and spoon the sauce over the chicken.",
      "Garnish with toasted sesame seeds and green onions.",
      "Serve."
    ]
  },
  {
    "title": "Hummus in the Blender",
    "meal": "side",
    "ingredients": [
      "2 15-ounce cans chickpeas (See notes below for home-cooked chickpeas)",
      "4 cloves garlic peeled",
      "2 tablespoons tahini (or 4 tablespoons sesame seeds)",
      "4 tablespoons fresh lemon juice",
      "1/2 teaspoon cumin",
      "1/4 teaspoon smoked paprika",
      "1/8 teaspoon chipotle chili powder or cayenne pepper",
      "Salt to taste"
    ],
    "directions": [
      "Drain one of the cans of chickpeas. Dump both cans (including liquid from one) into the blender. Place all remaining ingredients except salt in the blender in the order listed, using the smaller amounts. Start the machine on low and increase speed to high. Use the Vitamix plunger to break up air pockets and push chickpeas toward the blades, if necessary. (Other blenders: Stop and use a spatula to do this.) If the mixture is too thick, add water a tablespoon at a time. Turn up to the highest speed and blend for a few seconds until hummus is completely smooth.",
      "Stop blender and taste the hummus. Add additional seasonings and salt to taste and blend briefly to combine.",
      "Store hummus in a sealed container in the refrigerator. It's best after it's had a chance to rest for at least an hour, but use within a week."
    ]
  },
  {
    "title": "Hungarian Mushroom Soup",
    "meal": "dinner",
    "ingredients": [
      "4 tablespoons unsalted butter",
      "2 cups chopped onions",
      "1 pound fresh mushrooms, sliced",
      "2 teaspoons dried dill weed",
      "1 tablespoon paprika",
      "1 tablespoon soy sauce",
      "2 cups chicken broth",
      "1 cup milk",
      "3 tablespoons all-purpose flour",
      "1 teaspoon salt",
      "ground black pepper to taste",
      "2 teaspoons lemon juice",
      "¼ cup chopped fresh parsley",
      "½ cup sour cream"
    ],
    "directions": [
      "Melt the butter in a large pot over medium heat. Saute the onions in the butter for 5 minutes. Add the mushrooms and saute for 5 more minutes. Stir in the dill, paprika, soy sauce and broth. Reduce heat to low, cover, and simmer for 15 minutes.",
      "In a separate small bowl, whisk the milk and flour together. Pour this into the soup and stir well to blend. Cover and simmer for 15 more minutes, stirring occasionally.",
      "Finally, stir in the salt, ground black pepper, lemon juice, parsley and sour cream. Mix together and allow to heat through over low heat, about 3 to 5 minutes. Do not boil. Serve immediately."
    ]
  },
  {
    "title": "Macaroni and Cheese",
    "meal": "side",
    "ingredients": [
      "2 cups dry macaroni",
      "2 1/2 cups whole milk",
      "1 tablespoon of butter",
      "8 ounces shredded cheese (I used cheddar but feel free to mix it up)",
      "1 tablespoon cornstarch",
      "1 teaspoon mustard of choice (yellow, Dijon, and stoneground all have their merits)",
      "Hot sauce (optional)"
    ],
    "directions": [
      "Pour the milk in a sauce pan and season it with salt. Add the butter, bring it to a boil",
      "Add the pasta. Reduce to a simmer, and cook until the macaroni is tender and the milk has thickened.",
      "While the pasta is cooking, toss the cheese with cornstarch so that each strand is coated.",
      "Stir the mustard and hot sauce (to taste) into the pasta, season with salt and pepper if needed.",
      "stir in the cheese, handful by handful, letting each one melt completely before adding the next."
    ]
  },
  {
    "title": "Meatloaf",
    "meal": "dinner",
    "ingredients": [
      "2 pounds ground beef (or ground turkey, ground pork or a combination)",
      "2 large eggs",
      "4 Tablespoons ketchup",
      "2 Tablespoons Tamari Soy Sauce",
      "2 teaspoons dijon mustard",
      "4 cloves garlic , minced (or 1 1/2 teaspoons garlic powder)",
      "1 teaspoon salt",
      "1/2 teaspoon freshly ground black pepper",
      "1 teaspoon dried sage",
      "1/2 cup sweet onion , diced (or 3 teaspoons dried minced onion",
      "1/2 cup breadcrumbs",
      "1/2 cup ketchup",
      "2 teaspoons dijon mustard",
      "1/4 teaspoon ground nutmeg",
      "--- Mashed Potatos ---",
      "3 pounds Yukon Gold Potatoes , quartered",
      "1 cup water",
      "1/4 teaspoon salt",
      "1/4 cup milk",
      "1/4 cup sour cream",
      "3 Tablespoons butter",
      "1 teaspoon bouillon paste (I love 'Better than Bouillon)"
    ],
    "directions": [
      "Add all of the meatloaf ingredients to a large bowl and gently mix everything to combine (without over-working the meat).",
      "Form the meat mixture into a round loaf that will fit into your instant pot.",
      "Place the loaf on a large piece of aluminum foil and fold the edges up to make a secure nest for the meatloaf to rest in. (You want the edges high enough that grease from the loaf wont spill out onto the potatoes while cooking.)",
      "Add the quartered potatoes, water, and salt to the bottom of the instant pot.",
      "Lay the IP wire rack on top of the potatoes. Place the aluminum foil \"nest\" with the meatloaf on top of the rack.",
      "Secure the lid on the pot and close the pressure release valve. Select manual/High pressure and cook at high pressure for 25 minutes*.  When the timer beeps, allow the pressure to naturally release for 10 minutes.",
      "While the meatloaf cooks, make the sauce by combining all of the sauce ingredients in a bowl.",
      "Remove the IP lid, and carefully remove the meatloaf. Discard the aluminum foil and dippings. Spoon the meatloaf sauce over the top and cut into slices.",
      "Add the milk, sour cream, butter, bouillon paste, and salt and pepper to the bottom of the instant pot with the mashed potatoes. Mash to combine (but don't over-mash the potatoes).  Taste and adjust seasonings, as needed."
    ]
  },
  {
    "title": "Microwave White Chicken Chili",
    "meal": "dinner",
    "ingredients": [
      "3 whole heads garlic (about 48 cloves), unpeeled",
      "3/4 tsp salt, divided",
      "3 tbsp olive oil, divided",
      "2   poblano peppers",
      "1 medium onion",
      "1 1/2 lb boneless, skinless chicken thighs",
      "2 tbsp Southwestern Seasoning Mix",
      "2 cans (15.5 oz each) Great Northern beans, drained",
      "1 jar (16 oz) salsa verde"
    ],
    "directions": [
      "Using (5-in.) Santoku Knife, slice about 1/4 in. off the pointed top of garlic heads to expose cloves. Place garlic cut side up in Classic Batter Bowl. Sprinkle garlic with 1/4 tsp of the salt and drizzle with 2 tbsp of the oil. Cover batter bowl with lid; microwave on HIGH 3 minutes or until garlic is soft. Set aside to cool.",
      "Meanwhile, finely dice peppers using Santoku Knife. Chop onion using Food Chopper. Combine peppers and onion in Deep Covered Baker. Trim and finely dice chicken using Boning Knife. Add chicken, seasoning mix, remaining 1 tbsp oil and remaining 1/2 tsp salt to baker; mix well using Master Scraper. Microwave, covered, on HIGH 4 minutes; stir to separate chicken. Cover; microwave an additional 4-6 minutes or until chicken is cooked through.",
      "Meanwhile, gently squeeze cooled garlic from heads into batter bowl (discard skins); mash using Mix 'N Masher. Add beans and salsa to batter bowl. Transfer bean mixture to baker; mix well. Microwave, covered, on HIGH 5-7 minutes or until chili is heated through."
    ]
  },
  {
    "title": "Moo Goo Gai Pan",
    "meal": "dinner",
    "ingredients": [
      "1 pound of boneless skinless chicken breasts, thinly sliced",
      "1 large egg white",
      "2 tablespoons + 1 teaspoon of cornstarch divided use",
      "1 tablespoon vegetable oil divided use",
      "2 teaspoons minced garlic",
      "1 teaspoon minced ginger",
      "2 cups of sliced mushrooms",
      "8 oz baby corn",
      "1/2 cup of thinly sliced carrots",
      "8-ounce of sliced water chestnuts drained",
      "1 head of napa cabbage, thickly sliced",
      "3/4 cup chicken stock",
      "1 tablespoon soy sauce",
      "1  1/2 teaspoons sesame oil",
      "salt and pepper to taste"
    ],
    "directions": [
      "In a medium bowl whisk together the egg white and 1 tablespoon of cornstarch. Add the chicken slices and toss to coat. Refrigerate for 30 minutes, then strain and discard any excess liquid.",
      "In a large saucepan, heat 1 teaspoon of oil over medium high heat. Add the carrots and 1 tablespoon of water and cook 2-3 minutes, stirring constantly.",
      "Add the mushrooms and cook for 3-4 minutes or until mushrooms are browned and tender.",
      "Add the cabbage and cook 1-2 minutes more or until tender. Stir in the water chestnuts and baby corn. Season the vegetables to taste with salt and pepper.",
      "Remove the vegetables from the pan and place on a plate. Cover the plate with foil to keep warm.",
      "Wipe out the pan with a paper towel. Heat the remaining 2 teaspoons of oil over medium high heat.",
      "Add the the chicken to the pan and season with salt and pepper to taste. Cook, stirring occasionally, until chicken is cooked through, 3-4 minutes. Add the garlic and ginger and cook for 30 seconds more.",
      "In a small bowl whisk together the chicken stock, soy sauce and sesame oil. Whisk in 1 tablespoon + 1 teaspoon of cornstarch.",
      "Add the vegetables back to the pan and heat through, approximately 1 minute. Pour in the sauce and turn the high to heat. Bring the sauce to a boil and boil for approximately 1 minute or until sauce has just started to thicken, stirring occasionally.",
      "Serve immediately, over rice if desired."
    ]
  },
  {
    "title": "Pasta e Fagioli",
    "meal": "dinner",
    "ingredients": [
      "1 cup ditalini pasta",
      "2 tablespoons olive oil, divided",
      "1 pound spicy Italian sausage, casing removed",
      "3 cloves garlic, minced",
      "1 onion, diced",
      "3 carrots, peeled and diced",
      "2 stalks celery, diced",
      "3 cups chicken broth",
      "1 (16-ounce) can tomato sauce",
      "1 (15-ounce) can diced tomatoes",
      "1 teaspoon dried basil",
      "1 teaspoon dried oregano",
      "3/4 teaspoon dried thyme",
      "Kosher salt and freshly ground black pepper, to taste",
      "1 (15-ounce) can red kidney beans, drained and rinsed",
      "1 (15-ounce) can Great Northern beans, drained and rinsed"
    ],
    "directions": [
      "In a large pot of boiling salted water, cook pasta according to package instructions; drain well and set aside.",
      "Heat 1 tablespoon olive oil in a large stockpot or Dutch oven over medium heat. Add Italian sausage to the skillet and cook until browned, about 3-5 minutes, making sure to crumble the sausage as it cooks; drain excess fat and set aside.",
      "Add remaining 1 tablespoon oil to the stockpot. Stir in garlic, onion, carrots and celery. Cook, stirring occasionally, until tender, about 3-4 minutes.",
      "Whisk in chicken broth, tomato sauce, diced tomatoes, basil, oregano, thyme, Italian sausage and 1 cup water; season with salt and pepper, to taste. Bring to a boil; reduce heat and simmer, covered, until vegetables are tender, about 10-15 minutes.",
      "Stir in pasta and beans until heated through.",
      "Serve immediately."
    ]
  },
  {
    "title": "Pork Stew in Green Salsa (Guisado de Puerco con Tomatillos)",
    "meal": "dinner",
    "ingredients": [
      "½ cup all-purpose flour",
      "1 teaspoon salt (Optional)",
      "1 tablespoon ground black pepper",
      "½ teaspoon ground cumin",
      "1 (3 pound) boneless pork shoulder roast, trimmed of excess fat and cut into 1-inch cubes",
      "2 tablespoons olive oil, or more if needed",
      "1 large onion, chopped",
      "3 cloves garlic, minced",
      "2 cups chopped fresh tomatillos",
      "1 (7 ounce) can diced green chiles, drained",
      "2 fresh jalapeno peppers, seeded and chopped",
      "2 teaspoons dried marjoram",
      "½ cup chopped fresh cilantro",
      "1 cup water",
      "1 pinch salt, or to taste (Optional)",
      "2 tablespoons sour cream, divided",
      "6 sprigs cilantro"
    ],
    "directions": [
      "Stir together the flour, 1 teaspoon salt, pepper, and cumin in a large bowl. Place the cubed pork into the mixture, and stir well to coat the meat with the seasonings.",
      "Heat the olive oil in a large, heavy pan or Dutch oven over medium-high heat until the oil shimmers. Working in batches if necessary, place the meat into the hot pan in a single layer. Pan-fry the pork until brown on all sides, about 15 minutes. Remove the pork to a bowl, and cover to keep warm.",
      "Cook and stir the onion in the hot pan over medium heat, adding more olive oil if necessary, until the onion is translucent and beginning to brown, about 7 minutes. Return the meat to the pan and stir in the garlic, tomatillos, chiles, marjoram, chopped cilantro, and water. Check seasoning and add 1 pinch of salt to taste, if needed. Cover and simmer over low heat, stirring occasionally, until the meat is tender, about 1 hour. Skim excess fat off the stew before serving in bowls, garnished with a dollop of sour cream and a cilantro sprig on each bowl."
    ]
  },
  {
    "title": "Potato Pancakes",
    "source": "https://www.allrecipes.com/recipe/14089/potato-pancakes-i/",
    "meal": "breakfast",
    "ingredients": [
      "4 large potatoes",
      "1 yellow onion",
      "1 egg, beaten",
      "1 teaspoon salt",
      "ground black pepper to taste",
      "2 tablespoons all-purpose flour, or more as needed",
      "1 cup vegetable oil for frying, or as needed"
    ],
    "directions": [
      "Finely grate potatoes and onion into a large bowl. Drain off any excess liquid.",
      "Mix in egg, salt, and pepper. Add enough flour to make the mixture thick, about 2 to 4 tablespoons all together.",
      "Preheat the oven to low, about 200 degrees F (95 degrees C).",
      "Heat 1/4 inch oil in the bottom of a heavy skillet over medium-high heat. Drop two or three 1/4-cup mounds of batter into hot oil, and flatten with back of a spatula to make 1/2-inch-thick pancakes. Fry, turning pancakes once, until golden brown.",
      "Transfer pancakes to a plate lined with a paper towel to drain. Keep warm in the oven until serving. Repeat until all potato mixture is used."
    ]
  },
  {
    "title": "Pot Roast Hash",
    "meal": "dinner",
    "ingredients": [
      "1 cup warm water (110° to 115°)",
      "1 tablespoon beef base",
      "1/2 pound sliced fresh mushrooms",
      "1 large onion, coarsely chopped",
      "3 garlic cloves, minced",
      "1 boneless beef chuck roast (3 pounds)",
      "1/2 teaspoon pepper",
      "1 tablespoon Worcestershire sauce",
      "1 package (28 ounces) frozen O'Brien potatoes",
      "EGGS:",
      "2 tablespoons butter, divided",
      "10 large eggs, divided use",
      "1/2 teaspoon salt, divided",
      "1/2 teaspoon pepper, divided",
      "Minced chives"
    ],
    "directions": [
      "In a 6-qt. electric pressure cooker, whisk water and beef base; add mushrooms, onion and garlic. Sprinkle roast with pepper; transfer to pressure cooker. Drizzle with Worcestershire sauce. Lock lid; close pressure-release valve. Adjust to pressure-cook on high for 45 minutes. Allow pressure to naturally release for 10 minutes, then quick-release any remaining pressure.",
      "Remove roast; when cool enough to handle, shred meat with 2 forks. In a large skillet, cook potatoes according to package directions; stir in shredded beef. Using a slotted spoon, transfer vegetables from pressure cooker to skillet; heat through. Discard cooking juices.",
      "For eggs, heat 1 tablespoon butter over medium-high heat in another large skillet. Break 5 eggs, 1 at a time, into pan. Sprinkle with half the salt and pepper. Reduce heat to low. Cook until eggs reach desired doneness, turning after whites are set if desired. Repeat with remaining butter, eggs, salt and pepper. Serve eggs over hash; sprinkle with chives."
    ]
  },
  {
    "title": "Prime Rib Roast",
    "meal": "special dinner",
    "ingredients": [
      "5 -7\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tlb\n\t\t\t\t\t\t\t\t\t\tprime rib roast",
      "1\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcup\n\t\t\t\t\t\t\t\t\t\tunsalted butter, softened",
      "6\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcloves\n\t\t\t\t\t\t\t\t\t\tgarlic, minced",
      "2\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tTbsp\n\t\t\t\t\t\t\t\t\t\tfresh rosemary, chopped",
      "2\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tTbsp\n\t\t\t\t\t\t\t\t\t\tfresh thyme, chopped",
      "1\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tTbsp\n\t\t\t\t\t\t\t\t\t\tsalt",
      "1\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tTbsp\n\t\t\t\t\t\t\t\t\t\tLawry's seasoning salt",
      "1\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tTbsp\n\t\t\t\t\t\t\t\t\t\tblack pepper"
    ],
    "directions": [
      "Set sous vide machine to 56C/133F.",
      "Salt the rib roast to taste. Put the roast in a freezer bag, and remove the air through a vacuum sealer or the displacement method. Drop prime rib in the bath for 8 hours.",
      "Mix together softened butter, garlic, rosemary, thyme, salt and Lawry's seasoning salt together in a bowl until the compound butter is spreadable.",
      "Remove bag from bath and immediate transfer the roast into an ice bath Let t.he roast chill for 10 minutes. Remove bag from ice bath, take rib roast out of the bag and thoroughly pat dry.",
      "Preheat oven for 475F. Evenly coat garlic herbed compound butter on the entire prime rib. Place rib roast on a baking rack pan and cook for 15 minutes.",
      "Remove rib roast from oven. Let rest for 5 minutes.  If it is a bone-in roast, carefully carve off the bones making sure not to cut into the roast. Carve the prime rib into slabs and enjoy this heavenly piece of meat. *Pro tip - brush the excess butter and garlic mixture from the pan onto each piece before serving."
    ]
  },
  {
    "title": "Raspberry Lemon Drop Martini Recipe",
    "source": "https://cocktails.foodviva.com/martini-recipes/raspberry-lemon-drop-martini-recipe/",
    "meal": "drink",
    "ingredients": [
      "Ingredients:",
      "45 ml (1½ oz) Citroen Vodka",
      "20 ml (2/3 oz) Chambord (Black Raspberry Liqueur)",
      "30 ml (1 oz) Simple Syrup",
      "15 ml (1/2 oz) Lemon Juice",
      "20 ml (2/3 oz) Triple Sec (optional)",
      "1 Lemon Wheel",
      "Crushed Ice"
    ],
    "directions": [
      "Fill up cocktail shaker with crushed ice.",
      "Add all ingredients (except Chambord and lemon wheel) into cocktail shaker and shake it until it is completely chilled.",
      "Take chilled martini glass. Strain and pour mixed drink in it.",
      "Slowly pour chambord over it. Chambord will settle at the bottom center of glass giving it a layered color.",
      "Garnish with lemon wheel and serve.",
      "Fill up cocktail shaker with crushed ice.",
      "Add all ingredients (lemon wheel) into cocktail shaker and shake it thoroughly.",
      "Strain and pour drink in chilled martini glass.",
      "Garnish with skewered raspberries and serve."
    ]
  },
  {
    "title": "Refried Beans (Instant Pot)",
    "meal": "side",
    "ingredients": [
      "1 pound dried pinto beans, about 2 cups",
      "4 cups water",
      "1 cup coarsely chopped onion",
      "3 cloves garlic, minced",
      "1 teaspoon kosher salt, more as needed",
      "1 teaspoon ground cumin",
      "1/2 teaspoon dried oregano",
      "1/2 teaspoon freshly ground black pepper",
      "3 tablespoons bacon drippings, lard or olive oil",
      "1 dash cayenne pepper, optional"
    ],
    "directions": [
      "Place all ingredients in the Instant Pot",
      "Cook on high pressure for 55 minutes",
      "Mash, add salt to taste"
    ]
  },
  {
    "title": "Ribs",
    "meal": "dinner",
    "ingredients": [
      "1 rack baby back ribs or spare ribs about 1 1/2 to 2 pounds*",
      "1 cup water",
      "3 tablespoons apple cider vinegar",
      "1/2 teaspoon liquid smoke (optional)",
      "1/4 cup Homemade Barbecue Sauce or swap your favorite store-bought sauce, plus additional for serving",
      "1 tablespoon paprika",
      "1 teaspoon ground black pepper",
      "1 teaspoon kosher salt",
      "1 teaspoon chili powder",
      "1 teaspoon garlic powder",
      "1 teaspoon onion powder",
      "1/4 teaspoon cayenne pepper"
    ],
    "directions": [
      "In a small bowl, stir together the paprika, black pepper, salt, chili powder, garlic powder, onion powder, and cayenne. Rub it all over the ribs, generously coating all of the sides.",
      "Place the trivet (or rack) in the bottom of a 6-quart or larger Instant Pot. Pour in the water, apple cider vinegar, and liquid smoke. Place the ribs inside the pot, standing them on the trivet on their side and wrapping the rack around the inside of the pot like a circle.",
      "Cover and seal the Instant Pot. For baby back ribs: Cook on high (manual) pressure for 23 minutes (if you are making multiple racks and your ribs are super meaty, increase to 25 minutes). Allow the pressure to release naturally for 5 minutes, then vent to release the remaining pressure. For spare ribs: Cook on high for 35 minutes. Allow the pressure to naturally release completely (about 15 minutes). You will know it is released when the pin drops.",
      "Towards the end of the ribs’ cook time, place a rack in the upper third of your oven and set it to broil. Line a large baking sheet with aluminum foil. Transfer the cooked ribs to the foil, then brush liberally with barbecue sauce. Place under the broiler just until the sauce begins to caramelized, about 2 minutes. Do not walk away to make sure the ribs don’t burn."
    ]
  },
  {
    "title": "Rice Pudding",
    "meal": "dessert",
    "ingredients": [
      "1 cup Arborio rice",
      "1 1/2 cups water",
      "1/4 teaspoon salt",
      "2 cups whole milk, divided*",
      "1/2 cup sugar",
      "2 eggs",
      "1/2 teaspoon vanilla extract",
      "3/4 cup raisins"
    ],
    "directions": [
      "In pressure cooking pot, combine rice, water, and salt. Lock the lid in place and select High Pressure and 3 minutes cook time. When beep sounds turn off pressure cooker and use a natural pressure release for 10 minutes. After 10 minutes, release any remaining pressure with a quick pressure release.",
      "Add 1 1/2 cups milk and sugar to rice in pressure cooking pot; stir to combine.",
      "In a small mixing bowl, whisk eggs with remaining 1/2 cup milk and vanilla. Pour through a fine mesh strainer into pressure cooking pot. Select sauté and cook, stirring constantly, until mixture starts to boil. Turn off pressure cooker. Remove pot from the pressure cooker. Stir in raisins.",
      "Pudding will thicken as it cools. Serve warm or pour into serving dishes and chill.",
      "Served topped with whipped cream, and a sprinkle of cinnamon or nutmeg, if desired."
    ]
  },
  {
    "title": "Scalloped Potatoes",
    "meal": "side",
    "ingredients": [
      "1 tablespoon butter",
      "2 cloves garlic",
      "1 tablespoon flour",
      "1 cup milk",
      "1 teaspoon salt",
      "½ teaspoon pepper",
      "3 yukon potatoes, peeled",
      "2 tablespoons grated parmesan cheese",
      "fresh parsley, chopped, for garnish",
      "1 tablespoon butter",
      "2 cloves garlic",
      "1 tablespoon flour",
      "1 cup milk",
      "1 teaspoon salt",
      "½ teaspoon pepper",
      "3 yukon potatoes, peeled",
      "2 tablespoons grated parmesan cheese",
      "fresh parsley, chopped, for garnish"
    ],
    "directions": [
      "Preheat oven to 350°F (180°C).",
      "In a small pot, melt the butter and fry the garlic until it’s just starting to brown. Add the flour, salt and pepper. whisk until there are no lumps.",
      "Slowly drizzle in the milk while constantly whisking to make sure the mixture is smooth.",
      "Bring to a boil, then remove from heat.",
      "Slice the potatoes into about ⅛-inch (3 mm) thick slices, then fan them out in a small baking dish.",
      "Pour the sauce on top of the potatoes, then sprinkle with parmesan.",
      "Bake for about 1 hour, until the top is bubbly and golden brown.",
      "Sprinkle chopped parsley on top, then serve."
    ]
  },
  {
    "title": "Shepherd Pie",
    "meal": "dinner",
    "ingredients": [
      "5 cups mashed, boiled potatoes",
      "½ cup sour cream",
      "2 ounces cream cheese",
      "2 tablespoons butter, softened, divided",
      "1 egg yolk",
      "½ teaspoon kosher salt",
      "½ teaspoon freshly ground black pepper",
      "1 ½ teaspoons olive oil",
      "1 pound ground beef",
      "1 pinch salt and ground black pepper to taste",
      "1 (16 ounce) can stewed tomatoes with juice, chopped",
      "1 small onion, chopped",
      "1 small carrot, peeled and chopped",
      "½ cup corn",
      "1 cup Irish stout beer (such as Guinness®)",
      "1 cube beef bouillon",
      "1 tablespoon all-purpose flour",
      "1 tablespoon Worcestershire sauce",
      "¾ cup shredded sharp Cheddar cheese",
      "2 teaspoons chopped fresh parsley",
      "2 teaspoons smoked paprika"
    ],
    "directions": [
      "Stir potatoes, sour cream, cream cheese, 1 tablespoon butter, egg yolk, 1/2 teaspoon salt, and 1/2 teaspoon black pepper together in a bowl until smooth.",
      "Heat olive oil in a cast iron skillet or nonstick pan over medium-high heat. Add ground lamb, reduce heat to medium, and cook, stirring frequently, until browned and crumbly, 4 to 5 minutes. Pour off excess grease and season lamb with salt and black pepper to taste.",
      "Stir tomatoes with juice, onion, and carrot into ground lamb; simmer until vegetables are tender, 5 to 10 minutes. Add peas, reduce heat to low, and cook, stirring frequently, until peas are warmed, 2 to 3 minutes.",
      "Heat beer in a saucepan over medium heat; add beef bouillon. Cook and stir beer mixture until bouillon is dissolved, about 5 minutes.",
      "Heat remaining 1 tablespoon butter in a separate pan over medium-low heat until sizzling. Whisk flour into butter until thick and paste-like, about 1 minute. Stir beer mixture and Worcestershire sauce into flour mixture until gravy is smooth and thickened, 2 to 3 minutes. Stir gravy into lamb mixture and simmer until mixture is thickened, at least 5 minutes.",
      "Set oven rack about 6 inches from the heat source and preheat the oven's broiler. Grease a 9x12-inch baking dish.",
      "Pour lamb mixture into the prepared baking dish. Carefully spoon mashed potatoes over lamb mixture, covering like a crust. Sprinkle Cheddar cheese, parsley, and paprika over mashed potatoes.",
      "Broil in the preheated oven until crust is browned and cheese is melted, 4 to 5 minutes. Cool for about 5 minutes before serving."
    ]
  },
  {
    "title": "Sloppy Joes",
    "meal": "dinner",
    "ingredients": [
      "1 pound lean ground beef",
      "¼ cup chopped onion",
      "½ teaspoon garlic powder",
      "1 teaspoon prepared yellow mustard",
      "¾ cup ketchup",
      "salt to taste",
      "ground black pepper to taste"
    ],
    "directions": [
      "In a medium skillet over medium heat, brown the ground beef, and onion; drain off liquids.",
      "Stir in the garlic powder, mustard, and ketchup.",
      "Reduce heat, and simmer for 30 minutes.",
      "Season with salt and pepper."
    ]
  },
  {
  "title": "Southwest Seasoning",
  "source": "http://coffeecupsandcrafts.blogspot.com/2011/04/southwest-seasoning.html?spref=pi&m=1",
  "meal": "seasoning",
  "ingredients": [
    "2 tablespoons chili powder",
    "2 teaspoons ground cumin",
    "2 tablespoons paprika",
    "1 teaspoon black pepper",
    "1 tablespoon ground coriander",
    "1 teaspoon cayenne pepper",
    "1 tablespoon garlic powder",
    "1 teaspoon crushed red pepper",
    "1 tablespoon salt",
    "1 tablespoon dried oregano"
  ],
  "directions": [
    "Combine all ingredients thoroughly.",
    "As you can see, I'm starting to get a little low. Just about time to mix up a new batch!Check out these link parties!"
  ]
},
  {
    "title": "Spaghetti",
    "meal": "dinner",
    "ingredients": [
      "1 pound ground beef (or ½ lb ground Italian sausage and ½ lb ground beef)",
      "salt and freshly ground black pepper , to taste",
      "1 medium onion , chopped",
      "15 ounces tomato sauce",
      "6 ounces tomato paste",
      "1/2 teaspoon Italian seasoning",
      "1 Tablespoon dried parsley flakes",
      "1 teaspoon garlic powder",
      "crushed red pepper flakes , to taste",
      "1 Tablespoon Worcestershire sauce",
      "1 Tablespoon granulated sugar",
      "1 cup water",
      "1/4 cup fresh basil leaves (optional)",
      "spaghetti noodles , for serving"
    ],
    "directions": [
      "Season ground beef with salt and pepper.",
      "In a large skillet, add the beef and chopped onion and brown.  Drain excess grease.",
      "Add tomato sauce, tomato paste, Italian seasoning, parsley, garlic powder, crushed red pepper, worcestershire, and sugar to the skillet.",
      "Stir well to combine and bring to a boil. Add water and stir well.",
      "Reduce heat and simmer for 30 minutes. Add chopped basil before serving, if desired.",
      "This sauce tastes great in Spaghetti Pie, Million Dollar Spaghetti, Slow Cooker Lasagna and Instant Pot Spaghetti."
    ]
  },
  {
    "title": "Street Corn Nachos",
    "meal": "dinner",
    "ingredients": [
      "2 tbsp. extra-virgin olive oil",
      "3 c. frozen corn",
      "Kosher salt",
      "Freshly ground black pepper",
      "1 jalapeño, seeded and minced",
      "2 tbsp. lime juice, divided, plus wedges for serving",
      "1/4c. sour cream",
      "2 tbsp. mayonnaise",
      "1 (9-oz.) package corn tortilla chips",
      "2 1/2c. shredded Monterey Jack",
      "2 tbsp. crumbled cotija",
      "2 tbsp. freshly chopped cilantro"
    ],
    "directions": [
      "Preheat oven to 375°. In a large ovenproof skillet over high heat, heat oil. Add corn and season with salt and pepper. Cook, tossing until just cooked through, about 2 minutes. Transfer corn to a large bowl and wipe the skillet.",
      "Stir in jalapeño and 1 tablespoon lime juice to the corn. In a small bowl, stir together sour cream, mayonnaise, and remaining tablespoon lime juice. Season with salt.",
      "Layer tortilla chips and Monterey Jack in skillet. Bake until cheese is melty, about 5 minutes.",
      "Top broiled tortilla chips with corn mixture. Garnish with mayonnaise mixture, cotija, and cilantro."
    ]
  },
  {
    "title": "Stroganoff (Instant Pot)",
    "meal": "dinner",
    "ingredients": [
      "12 oz package of wide ribbon-like egg noodles, boiled separately according to package",
      "1.5-2 lbs of beef stew meat/chuck cubes",
      "Kosher salt, a few generous shakes for seasoning the meat",
      "Black pepper, a few generous shakes for seasoning the meat",
      "3 tbsp of olive oil",
      "2 tbsp of salted butter",
      "1 large yellow onion, diced",
      "24 oz of Baby Bella mushrooms, sliced",
      "1 tbsp of crushed garlic",
      "1/4 cup of a dry white wine (Chardonnay or like)",
      "1 tbsp of dijon mustard",
      "1 tsp of seasoned salt",
      "2 tsp of Beef Better Than Bouillon",
      "1.5 cups of water",
      "1 tsp of dried thyme",
      "2 tbsp of cornstarch + 2 tbsp of water",
      "1 packet of dry onion dip/soup mix",
      "1 cup (8 oz) of sour cream",
      "5.2 oz of Boursin Garlic & Herb"
    ],
    "directions": [
      "Cook the egg noodles on the stovetop according to package instructions while the meat’s cooking and strain and set aside (Note: you can also do this during Step 7 while the Stroganoff is pressure cooking, but just make sure you do it separately on the stove and don’t add the noodles directly into the pot while pressure cooking or they will absorb too much of the liquid and will become mushy)",
      "Season the meat with the kosher salt & pepper (about 1-2 tsp of each should be fine) and rub it in well",
      "Add the olive oil and butter to the Instant Pot and hit “Sauté” and adjust so it’s on the “More” or “High” setting. After about 3 minutes (and once the butter’s melted and oil’s bubbling), add in the meat and sear on all sides so it’s lightly browned (about 2-3 minutes total; the meat shouldn’t be fully cooked at all). Remove the meat with a slotted spoon and set aside in a bowl for the time being",
      "Now, add the onion to the pot with the already heated oil and butter and let cook for 2 minutes and then add the mushrooms and let cook for 3 minutes more. Then, add in the garlic and cook for another minute",
      "Next, add in the white wine and stir for a minute followed by the dijon mustard and seasoned salt, stir well and deglaze (scrape) the bottom of the pot so nothing’s stuck to it",
      "Lastly, add in the beef broth and thyme and stir well followed by adding back in the browned beef",
      "Secure the lid, hit the “Keep Warm/Cancel” button followed by the “Manual” or “Pressure Cook” button High Pressure for 7 minutes for firmer meat and 12 minutes for more tender meat. Do a quick release when done OR allow a 10 minute natural release (meaning you do nothing for 10 minutes when done and the timer count up to either “00:10” or “L0:10”) followed by a quick release if you wish it to be more tender – this goes for either cooking time you choose",
      "When the lid comes off, hit the “Keep Warm/Cancel” button and then hit “Sauté” again and adjust so it’s on the “More” or “High” setting. Bring the pot to a bubble and add in the cornstarch slurry and stir immediately. Then, add in the onion mix packet and let bubble for a minute and then turn the pot to “Keep Warm” so that the bubbles die down",
      "Once the bubbles have mostly subsided, add in the sour cream and Boursin. Stir well until they are both totally melded into the sauce and it will be ready!"
    ]
  },
  {
    "title": "Swiss Steak",
    "source": "https://www.themagicalslowcooker.com/slow-cooker-swiss-steak/#recipe",
    "meal": "dinner",
    "ingredients": [
      "2.5 lbs. round steaks or bottom or top round roast cut into thick steaks (2-4 pounds will work fine in this recipe)",
      "1/2 cup flour",
      "1 tsp. salt",
      "1/4 tsp. black pepper",
      "4 Tbsp. cooking oil",
      "10.5 oz. Campbell's beef consomme or beef broth",
      "29 oz. petite diced tomatoes (two 14.5 oz. cans) do not drain",
      "2 Tbsp. Worcestershire sauce",
      "1 cup diced onion",
      "1 green bell pepper",
      "2 garlic cloves minced"
    ],
    "directions": [
      "On a large plate add the flour and salt and pepper. Mix this together.",
      "Dredge each steak in this mixture on both sides, transfer to another plate. Save any excess flour mixture, you will add this to the slow cooker with the meat later.",
      "Set a large skillet to medium high heat. Add enough oil to coat the pan. Brown the steaks on both sides, no need to cook through. You may have to cook the meat in two batches if your pan is too small, add more oil inbewteen batches. Add the browned steaks to the slow cooker. Sprinkle over any excess flour from the plate.",
      "Deglaze the pan that you browned the meat in with by adding the beef consomme and scrapping up any brown bits. Add to the slow cooker on top of the beef.",
      "Add the remaining ingredients, stir.",
      "Place the lid on the slow cooker. Cook on LOW for 7 hours or HIGH for 4 hours with out opening the lid during the cooking time."
    ]
  },
  {
    "title": "Thai Peanut Chicken (Air Fryer)",
    "source": "https://twosleevers.com/thai-peanut-chicken/",
    "meal": "dinner",
    "ingredients": [
      "▢ 1 pound   Bone-in Skin-on Chicken Thighs",
      "▢ 1/4 cup   Creamy Peanut Butter",
      "▢ 1 tablespoon   Sriracha Sauce, (adjust for your spice needs)",
      "▢ 1 tablespoon   Soy Sauce",
      "▢ 2 tablespoons   Thai sweet chili sauce",
      "▢ 2 tablespoons   lime juice",
      "▢ 1 teaspoon   Minced Garlic",
      "▢ 1 teaspoon   Minced Ginger",
      "▢ 1/2 teaspoon   Kosher Salt, to taste",
      "▢ 1/2 cup   hot water",
      "▢ 5-6 teaspoons   Cilantro, finely chopped",
      "▢ 1/4 cup   Chopped Green Scallions",
      "▢ 2-3 tablespoons   crushed peanuts"
    ],
    "directions": [
      "Mix together peanut butter, sriracha, soy sauce, sweet chili sauce, lime juice, and salt. Pour in the hot water and mix until you have a smooth mixture.",
      "Place the chicken in a zip-top bag. Pour in half of the sauce and mix until the chicken is well coated. If you have the time, allow the chicken to marinate for 30 minutes or up to 24 hours in the refrigerator.",
      "Remove the chicken from the bag, bringing with it as much of the marinade as you can. Place the coated chicken in the air fryer basket.",
      "Set the air fryer to 350F for 20-22 minutes or until the chicken thighs are heated 165F at their thickest part.",
      "Garnish with cilantro, onion, and peanuts. Serve with the rest of the sauce for dipping."
    ]
  },
  {
    "title": "Tomatillo Salsa Verde",
    "meal": "condiment",
    "ingredients": [
      "1 pound tomatillos, husked",
      "½ cup finely chopped onion",
      "1 teaspoon minced garlic",
      "1 serrano chile peppers, minced",
      "2 tablespoons chopped cilantro",
      "1 tablespoon chopped fresh oregano",
      "½ teaspoon ground cumin",
      "1 ½ teaspoons salt, or to taste",
      "2 cups water"
    ],
    "directions": [
      "Place tomatillos, onion, garlic, and chile pepper into a saucepan. Season with cilantro, oregano, cumin, and salt; pour in water. Bring to a boil over high heat, then reduce heat to medium-low, and simmer until the tomatillos are soft, 10 to 15 minutes.",
      "Using a blender, carefully puree the tomatillos and water in batches until smooth."
    ]
  },
  {
    "title": "Tomato Basil Soup",
    "meal": "dinner",
    "ingredients": [
      "4 tomatoes - peeled, seeded and diced",
      "4 cups tomato juice",
      "14 leaves fresh basil",
      "1 cup heavy whipping cream",
      "½ cup butter",
      "salt and pepper to taste"
    ],
    "directions": [
      "Place tomatoes and juice in a stock pot over medium heat. Simmer for 30 minutes. Puree the tomato mixture along with the basil leaves, and return the puree to the stock pot.",
      "Place the pot over medium heat, and stir in the heavy cream and butter. Season with salt and pepper. Heat, stirring until the butter is melted. Do not boil."
    ]
  },
  {
    "title": "Tortillas (Spelt)",
    "meal": "side",
    "ingredients": [
      "1 1⁄2   cups    spelt berries, ground in a mill  or 2   cups    spelt flour",
      "1    teaspoon    salt",
      "1 1⁄2   teaspoons    baking powder",
      "1    tablespoon    oil",
      "3⁄4   cup    hot water"
    ],
    "directions": [
      "In a bowl, mix all ingredients well.",
      "Cover and let sit in a warm place for 20 minutes.",
      "Divide into 8 equal parts and let sit, covered, another 20 minutes.",
      "Roll each ball out to a 6- or 7-inch circle shape.  I've found it helps to flatten each ball with your hand.  Then take the rolling pin and roll from the center outwards, back and forth a few times as you go around the circle.  When it starts to get thinner, take your left hand (if you're right handed) and turn the tortilla a couple inches.  Use your right hand to use the rolling pin (holding in the middle) and roll from the center outwards.  Keep turning and rolling until it is paper thin.",
      "Preheat a skillet on medium high heat.",
      "Place a tortilla into the skillet and watch until bubbles form.  This won't take long.",
      "After bubbles form, and the bottom is lightly brown (or there are darker spots), flip over, press down once or twice, and cook for about 30-45 seconds, or if smoke appears.",
      "Cook remaining tortillas, watching carefully, and place in a plastic bag, with wet paper towels in between them (or at least on top and bottom of stack) to keep them soft and moist.",
      "Refrigerate for later or remove the paper towels and freeze."
    ]
  },
  {
    "title": "Tzatziki",
    "meal": "condiment",
    "ingredients": [
      "1/2 of a large cucumber, unpeeled",
      "1 1/2 cups plain full-fat Greek yogurt",
      "2 large garlic cloves, finely minced",
      "2 tablespoons extra virgin olive oil",
      "1 tablespoon white vinegar",
      "1/2 teaspoon salt",
      "1 tablespoon minced fresh dill"
    ],
    "directions": [
      "Grate the cucumber and drain through a fine mesh sieve overnight in the fridge.",
      "Combine the yogurt, garlic, oil, vinegar, and salt in a large bowl. Cover and refrigerate overnight.",
      "Transfer the grated cucumber and fresh dill to the yogurt mixture and stir to combine. Serve chilled with pita bread for dipping."
    ]
  },
  {
  "title": "Walnut Crepes",
  "source": "https://www.suncakemom.com/treats/walnut-crepe-the-gundel-pancake",
  "meal": "breakfast",
  "ingredients": [
    "3 cup / 400g Flour",
    "2½ cup / 600ml Soda water",
    "½ cup / 100ml Cooking oil",
    "⅞ cup / 200ml Heavy cream",
    "1 tablespoon Honey or sweetener of choice",
    "9 oz / 250g Walnuts ½ ground, ½ finely chopped",
    "½ cup / 100g Raisins",
    "1 Lemon zest",
    "1 tablespoon Cinnamon ground",
    "1 tablespoon Rum or rum aroma",
    "1 cup / 250ml milk",
    "5 oz / 140g Chocolate coarsely chopped",
    "2 Egg yolks",
    "1 tablespoon Honey or sweetener of choice",
    "2 tablespoon Cocoa powder unsweetened",
    "1 tablespoon Butter unsalted",
    "1 tablespoon Rum or rum aroma"
  ],
  "directions": [
    "Put the ingredients into a bowl and mix them together evenly. Keep mixing until we get a smooth runny thin mixture",
    "Heat medium size frying-pan on high heat. Pour some batter into the pan then tilt the pan with a circular motion so that the batter coats the surface evenly.",
    "Cook for about 2 to 2.5 minutes. Loosen and flip it over to the other side.",
    "Cook the other side for another minute then remove from the heat.",
    "Making crepes is art and that means variety. Check out how to make various sugar free crepes!",
    "Pour cream and honey into a medium size saucepan and bring it to boil whilst stirring it.",
    "Add walnuts, raisins, lemon zest, rum and finally the ground cinnamon. Reduce the heat to medium and put it back onto the hob to cook it for about 3 minutes. Stir it continuously as without stirring it would burn down.",
    "Melt chocolate and milk over boiling water.",
    "Whisk egg yolks in rapidly then add honey cocoa powder butter and rum into the chocolate sauce and place the bowl back over the boiling water.",
    "Stir it until evenly combined then take it off the heat.",
    "Spread about two tablespoons of filling on half of a crepe.",
    "Fold it into half.",
    "Fold it again to get a quarter of a circle.",
    "Pour some chocolate sauce on top before serving it."
  ]
},
  {
    "title": "Wild mushroom gravy with red wine",
    "meal": "condiment",
    "ingredients": [
      "2 tablespoon oil",
      "1 cup chopped white onion",
      "24 ounces mushrooms, sliced or chopped (I used Porcini, Shiitake, Oyster Mushrooms)",
      "4 cloves garlic, finely chopped",
      "1 tablespoon finely chopped fresh rosemary",
      "2 tablespoons finely chopped fresh thyme",
      "¼ cup red wine",
      "2 cups vegetable broth",
      "3 tablespoons organic soy sauce",
      "2 tablespoons tapioca flour",
      "¼ teaspoon ground black pepper",
      "salt, to taste"
    ],
    "directions": [
      "Heat oil in a large skillet over medium-high heat, then add onion and cook for 3 to 4 minutes or until translucent.",
      "Add mushrooms and cook for 10 to 12 minutes or until they release their liquid and become tender. Stir in garlic, rosemary and thyme and continue to cook for 1 minute until fragrant. Add wine and cook 1 minute, stirring constantly. Stir in broth and bring to a simmer.",
      "In a small bowl, whisk together soy sauce and tapioca flour to form a thick paste. Add mixture to the skillet, whisking constantly to make sure paste dissolves. Bring mixture to a boil and cook 2 minutes, stirring constantly. Add pepper and serve gravy hot."
    ]
  },
  {
    "title": "Zuppa Toscana",
    "meal": "dinner",
    "ingredients": [
      "16 oz spicy Italian sausage",
      "8 slices of bacon",
      "½ large onion diced",
      "2-3 cloves of garlic minced",
      "28 oz low-sodium chicken broth",
      "3 cups water",
      "5 medium russet potatoes thinly sliced",
      "1 tsp crushed red pepper flakes optional",
      "Salt and pepper optional",
      "4 cups chopped kale",
      "1 cup heavy whipping cream",
      "Parmesan cheese"
    ],
    "directions": [
      "Brown sausage in a large pot or dutch oven.",
      "Remove sausage with a slotted spoon and set aside.",
      "Cut bacon into small pieces.",
      "Add bacon to pot and cook until crispy.",
      "Stir in chopped onion. Cook for 5 to 6 minutes or until onion is translucent.",
      "Stir in minced garlic and cook for 1 minute, stirring frequently.",
      "Add chicken broth and water to the pot. Add crushed red pepper flakes, salt, and pepper if desired.",
      "Add thinly sliced potatoes (I use a mandoline) and the cooked sausage to the pot and bring to a simmer over medium heat.",
      "Continue cooking until potatoes are tender, about 10 minutes.",
      "Add the kale to the soup, and simmer for an additional 5 to 10 minutes, stirring occasionally.",
      "Stir in the heavy cream and let heat through.",
      "Ladle soup into bowls and serve with Parmesan cheese."
    ]
  }
]
